NCommander/openbsd-src-with-branches/sbin/fsck_msdos/fsck_msdos.8
.\"	$OpenBSD: fsck_msdos.8,v 1.13 2007/12/30 13:20:13 sobrado Exp $
.\"	$NetBSD: fsck_msdos.8,v 1.4 1996/10/17 20:41:24 cgd Exp $
.\"
.\" Copyright (C) 1995 Wolfgang Solfrank
.\" Copyright (c) 1995 Martin Husemann
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: December 30 2007 $
.Dt FSCK_MSDOS 8
.Os
.Sh NAME
.Nm fsck_msdos
.Nd DOS/Windows (FAT) file system consistency checker
.Sh SYNOPSIS
.Nm fsck_msdos
.Op Fl fnpy
.Ar filesystem ...
.Sh DESCRIPTION
The
.Nm
utility verifies and repairs
.Tn FAT
file systems (more commonly known as
.Tn DOS
file systems).
It checks the specified file systems and tries to repair all
detected inconsistencies, requesting confirmation before
making any changes.
.Pp
If the
.Fl p
flag is given,
.Nm
preens the specified file systems.
It is normally started this way by
.Xr fsck 8
run from
.Xr rc 8
during automatic reboot, when a FAT file system is detected.
When preening file systems,
.Nm
will fix common inconsistencies non-interactively.
If more serious problems are found,
.Nm
does not try to fix them, indicates that it was not
successful, and exits.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f
This option is ignored by
.Nm fsck_msdos ,
and is present only for compatibility with programs that
check other file system types for consistency, such as
.Xr fsck_ffs 8 .
.It Fl n
Assume a
.Dq no
response to all questions asked by
.Nm
except for
.Dq CONTINUE? ,
which is assumed to be affirmative.
File systems will not be opened for writing.
This is the default for file systems to be checked that are
concurrently mounted writable.
.It Fl p
Preen the specified file systems.
.It Fl y
Causes
.Nm
to assume
.Dq yes
as the answer to all operator questions.
.El
.Sh SEE ALSO
.Xr fs 5 ,
.Xr fstab 5 ,
.Xr fsck 8 ,
.Xr fsck_ffs 8 ,
.Xr mount_msdos 8 ,
.Xr newfs_msdos 8 ,
.Xr rc 8
.Sh BUGS
.Nm
is still under construction.
