NCommander/openbsd-src-with-branches/share/man/man7/airport.7
.\"	$OpenBSD: airport.7,v 1.1 2017/05/28 19:26:33 benno Exp $
.\"
.\" Copyright (c) 2017 Sebastian Benoit.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 28 2017 $
.Dt AIRPORT 7
.Os
.Sh NAME
.Nm airport
.Nd list of IATA airport codes
.Sh DESCRIPTION
The
.Nm
file is a list of airports that have an IATA airport code.
The list is sorted alphabetically by airport code.
.Pp
The list is not a complete list of all IATA codes.
New airports can only be added by
.Ox
developers who have visited an airport and thereby have verified its existence.
.Sh FILES
.Bl -tag -width /usr/share/misc/airport -compact
.It Pa /usr/share/misc/airport
.El
.Sh SEE ALSO
.Lk http://www.iata.org/codes "Airline and Airport Code Search"
.Sh CAVEATS
There are also railway stations with IATA codes.
These may not be listed, except if someone landed there by plane and
survived to update the file.
