NCommander/openbsd-src-with-branches/usr.sbin/smtpd/mail.maildir.8
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2017 Gilles Chehade <gilles@poolp.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 16 2014 $
.Dt MAIL.MAILDIR 8
.Os
.Sh NAME
.Nm mail.maildir
.Nd store mail in a maildir
.Sh SYNOPSIS
.Nm mail.maildir
.Op Fl d Ar maildir
.Sh DESCRIPTION
.Nm
reads the standard input up to an end-of-file and adds it to the
provided mail directory.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d Ar maildir
Specify the path to user mail directory.
.El
.Sh EXIT STATUS
.Ex -std mail.maildir
.Sh SEE ALSO
.Xr mail 1 ,
.Xr smtpd 8
