NCommander/openbsd-src-with-branches/usr.sbin/smtpd/mail.mda.8
.\"	$OpenBSD: mail.file.8,v 1.2 2017/02/14 20:36:41 gilles Exp $
.\"
.\" Copyright (c) 2017 Gilles Chehade <gilles@poolp.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 14 2017 $
.Dt MAIL.MDA 8
.Os
.Sh NAME
.Nm mail.mda
.Nd deliver mail to a program
.Sh SYNOPSIS
.Nm mail.mda
.Ar program
.Sh DESCRIPTION
.Nm
executes the program and its parameters.
The program must read from the standard input up to an end-of-file
and acknowledge delivery success or failure with its exit status.
.Sh EXIT STATUS
.Ex -std mail.mda
.Sh SEE ALSO
.Xr mail 1 ,
.Xr smtpd 8
