NCommander/openbsd-src-with-branches/share/man/man4/man4.macppc/mesh.4
.\" $OpenBSD$
.\" Copyright (c) 2006 Gordon Willem Klok <gwk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 6, 2006
.Dt MESH 4 macppc
.Os
.Sh NAME
.Nm mesh
.Nd Macintosh Enhanced SCSI Hardware
.Sh SYNOPSIS
.Cd "mesh* at macobio? flags 0xffff"
.Cd "scsibus* at mesh?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the onboard SCSI/2 (fast SCSI) controller
found on many old world Apple Power Macintosh systems and clones.
.Sh DEVICE FLAGS
The
.Nm
driver supports the following flags.
.Bl -tag -width "Bits XX-XX"
.It Bits 0-7:
Disable disconnect/reselect for the corresponding SCSI ID
number.
.It Bits 8-15: Disable synchronous negotiation for the corresponding
SCSI ID number.
.El
.Pp
Disconnect/reselect should be enabled for tape devices, or SCSI bus
performance may be degraded.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr macobio 4 ,
.Xr scsi 4
.Sh BUGS
No support for tagged queueing.
Synchronous transfers and disconnect/reconnect are disabled by default.
