NCommander/openbsd-src-with-branches/sbin/nmeaattach/nmeaattach.8
.\"	$OpenBSD: nmeaattach.8,v 1.6 2007/05/31 19:19:46 jmc Exp $
.\"
.\" Copyright (c) 2006 - 2008 Marc Balmer <mbalmer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt NMEAATTACH 8
.Os
.Sh NAME
.Nm nmeaattach
.Nd attach serial lines as timedelta sensors
.Sh SYNOPSIS
.Nm nmeaattach
.Op Fl dhm
.Op Fl s Ar baudrate
.Op Fl t Ar cond
.Ar device
.Sh DESCRIPTION
.Nm
is used to designate a serial line with a device that outputs NMEA 0183 data as
a source of timedelta sensors.
.Pp
The
.Nm
command is deprecated and might be removed from a later version of
.Ox .
Please use the
.Xr ldattach 8
command instead.
.Pp
The following operands are supported by
.Nm nmeaattach :
.Bl -tag -width Ar
.It Fl d
Do not daemonize.
.It Fl h
Turn on RTS/CTS flow control.
By default, no flow control is done.
.It Fl m
Maintain modem control signals after closing the line.
Specifically, this disables HUPCL.
.It Fl s Ar baudrate
Specifies the speed of the connection.
If not specified, the default of 4800 baud is used.
.It Fl t Ar cond
Chooses the condition which will cause the current system time to be
immediately copied to the terminal timestamp storage for subsequent use by
.Xr nmea 4 .
Only one can be used.
.Pp
.Bl -tag -width DCDXX -offset indent -compact
.It dcd
Copy the timestamp when DCD is asserted.
.It !dcd
Copy the timestamp when DCD is deasserted.
.It cts
Copy the timestamp when CTS is asserted.
.It !cts
Copy the timestamp when CTS is deasserted.
.El
.Pp
If no condition is specified, the
.Xr nmea 4
line discipline will timestamp on receiving the leading
.Sq $
character of each GPRMC sentence.
.Pp
Configuring the NMEA device to issue a PPS signal is device specific and
should be done by device specific applications.
.It Ar device
Specifies the name of the serial line.
.Ar device
should be a string of the form
.Dq cuaXX ,
or
.Dq /dev/cuaXX .
.El
.Pp
Only the superuser may designate NMEA devices.
.Pp
To detach the interface, kill off the
.Nm
process.
.Sh SEE ALSO
.Xr ldattach 8,
.Xr nmea 4 ,
.Xr tty 4
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 4.0 .
