NCommander/openbsd-src-with-branches/share/man/man4/man4.landisk/power.4
.\"     $OpenBSD: power.4,v 1.2 2007/03/01 22:53:44 martin Exp $
.\"
.\"
.\" Copyright (c) 2007 Martin Reindl
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 8, 2007
.Dt POWER 4 landisk
.Os
.Sh NAME
.Nm power
.Nd power switch
.Sh SYNOPSIS
.Cd "power0 at obio?"
.Sh DESCRIPTION
Landisk models provide an interrupt when the power switch is flipped to the
Off position.
The
.Nm
driver catches that interrupt.
If the
.Va machdep.kbdreset
.Xr sysctl 8
is set to 1,
.Nm power
will signal
.Xr init 8
to do a clean shutdown.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr obio 4
.Sh HISTORY
Support for the
.Nm
driver first appeared in
.Ox 4.1 .
