NCommander/openbsd-src-with-branches/share/man/man4/man4.zaurus/zrc.4
.\" $OpenBSD$
.\"
.\" Copyright (c) 2005 Uwe Stuehler <uwe@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 17, 2005
.Dt ZRC 4 zaurus
.Os
.Sh NAME
.Nm zrc
.Nd Zaurus remote control support
.Sh SYNOPSIS
.Cd "zrc0     at pxaip?"
.Cd "wskbd*   at zrc?"
.Sh DESCRIPTION
The
.Nm
provides support for the CE-RH2 remote control on the Zaurus C1000,
C3000 and C3100.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pxaip 4 ,
.Xr wscons 4 ,
.Xr wskbd 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 3.9 .
