NCommander/openbsd-src-with-branches/share/man/man4/man4.hppa/gecko.4
.\"     $OpenBSD$
.\"
.\" Copyright (c) 2007 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt GECKO 4 hppa
.Os
.Sh NAME
.Nm gecko
.Nd GeckoBOA BC GSC+ port
.Sh SYNOPSIS
.Cd "gecko* at uturn?"
.Sh DESCRIPTION
.Nm
provides support for the GeckoBOA bus converter ports connecting additional
GSC+ busses to
.Xr uturn 4 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uturn 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 4.4 .
