NCommander/openbsd-src-with-branches/share/man/man4/man4.hppa/gsckbc.4
.\" $OpenBSD: gsckbc.4,v 1.1 2003/01/31 23:03:12 miod Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 31, 2003
.Dt GSCKBC 4
.Os
.Sh NAME
.Nm gsckbc
.Nd PS/2-like controller driver
.Sh SYNOPSIS
.Cd "gsckbc* at gsc? irq 26"
.Cd "gsckbd* at gsckbc?"
.Cd "pms*    at gsckbc?"
.Sh DESCRIPTION
The
.Nm
driver handles resource allocation and device attachment for the
PS/2 input device ports.
Each
.Nm
driver provides the logical connection for one child device, either the
.Dq keyboard
port or the
.Dq mouse
port.
.Sh SEE ALSO
.Xr gsc 4 ,
.Xr gsckbd 4 ,
.Xr pms 4
