NCommander/openbsd-src-with-branches/share/man/man4/man4.hppa/power.4
.\"	$OpenBSD: power.4,v 1.1 2003/08/20 21:17:08 mickey Exp $
.\"
.\" Copyright (c) 2003 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF MIND,
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 20, 2003
.Dt POWER 4 hppa
.Os
.Sh NAME
.Nm power
.Nd power button and power fail support
.Sh SYNOPSIS
.Cd "power0 at mainbus?"
.Sh DESCRIPTION
.Tn HP PA-RISC
machines support power failure detection in different forms:
.Pp
.Bl -bullet -offset indent -compact
.It
.Dq soft
power button
.It
power failure interrupt
.El
.Pp
The
.Nm
driver tries its best to determinine the power failure condition
that is a result of a power button being depressed or a power supply
system failure or a similar condition.
Upon detection of any of the aforementioned conditions, it tries to gracefully
.Pq if possible
shutdown the system through a call to the
.Xr boot 9
function.
.Pp
On systems equipped with the
.Xr lasi 4
bus adapter, we find a
.Dq soft
power button which upon depression gives us a signal in the
.Dq power register
and thus polling periodically we detect the event.
Since that bit comes directly from the power button without any dampening,
we perform a second long delay;
thus quick transitions off and on will
.Em not
result in a shutdown.
.Pp
On modern systems, an interruption is signalled upon the power
button depression and thus this avoids polling and does not require
.Pq as does being implemented in hardware
dampening.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr lasi 4 ,
.Xr boot 9
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 3.4 .
