NCommander/openbsd-src-with-branches/bin/pwd/pwd.1
.\"	$OpenBSD: pwd.1,v 1.19 2010/09/03 09:53:20 jmc Exp $
.\"	$NetBSD: pwd.1,v 1.10 1995/09/07 06:47:30 jtc Exp $
.\"
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)pwd.1	8.2 (Berkeley) 4/28/95
.\"
.Dd $Mdocdate: September 3 2010 $
.Dt PWD 1
.Os
.Sh NAME
.Nm pwd
.Nd return working directory name
.Sh SYNOPSIS
.Nm pwd
.Op Fl LP
.Sh DESCRIPTION
The
.Nm
utility prints the absolute pathname of the current working directory to
the standard output.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl L
If the
.Ev PWD
environment variable is an absolute pathname that references the
current directory and doesn't contain path components of "." or "..",
then
.Ev PWD
is printed as the name of the current directory.
Otherwise, act as if the
.Fl P
option was given.
.It Fl P
Print the physical path to the current working directory, with symbolic
links in the path resolved.
.El
.Pp
The 
.Fl L
and
.Fl P
options override each other and the command's actions are determined
by the last one specified.
The default if no options are given is
.Fl P .
.Pp
For an explanation of the directory hierarchy,
see
.Xr hier 7 .
.Sh ENVIRONMENT
.Bl -tag -width PWD
.It Ev PWD
The presumptive logical path to the current working directory.
.Sh EXIT STATUS
.Ex -std pwd
.Sh SEE ALSO
.Xr ksh 1 ,
.Xr getcwd 3 ,
.Xr hier 7
.Sh STANDARDS
The
.Nm
utility is compliant with the
.St -p1003.1-2008
specification.
.Sh HISTORY
An
.Nm
utility appeared in
.At v5 .
Support for the
.Fl L
option was added in
.Ox 5.6 .
.Sh CAVEATS
.Nm
also exists as a built-in to
.Xr ksh 1 ,
which may have a different default behavior.
