NCommander/openbsd-src-with-branches/share/man/man4/man4.vax/legss.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2008 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt LEGSS 4 vax
.Os
.Sh NAME
.Nm legss
.Nd Low-End Graphics Subsystem
.Sh SYNOPSIS
.Cd "legss* at mbus0 mid 7"
.Cd "wsdisplay* at legss?"
.Sh DESCRIPTION
The
.Nm
is a 8 bit color frame buffer found in VAXstation 35x0 and 38x0 series.
An optional VCB03 16 plane option expands it to a 24 bit color frame buffer.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh BUGS
The 16 plane option is currently not supported, and needs to be removed
for the
.Nm
driver to operate properly.
