NCommander/openbsd-src-with-branches/share/man/man4/man4.vax/lkms.4
.\"     $OpenBSD: lkms.4,v 1.3 2006/08/27 17:32:58 miod Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate$
.Dt LKMS 4 vax
.Os
.Sh NAME
.Nm lkms
.Nd serial mouse driver
.Sh SYNOPSIS
.Cd "lkms0 at dz0 line 1 " Pq "VAXstation"
.Cd "lkms0 at qsc0 line 3" Pq "VXT2000"
.Cd "wsmouse* at lkms?"
.Sh DESCRIPTION
The
.Nm
driver provides support for DEC mice hooked up to
.Xr dz 4
or
.Xr qsc 4
serial controllers within the
.Xr wscons 4
framework.
.Sh SEE ALSO
.Xr dz 4 ,
.Xr intro 4 ,
.Xr qsc 4 ,
.Xr wscons 4 ,
.Xr wsmouse 4
