NCommander/openbsd-src-with-branches/bin/chio/chio.conf.5
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2007 Jason McIntyre <jmc@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate$
.Dt CHIO.CONF 5
.Os
.Sh NAME
.Nm chio.conf
.Nd medium changer configuration file
.Sh DESCRIPTION
.Nm
is used to configure some aspects of
.Xr chio 1 ,
a medium changer.
.Pp
The configuration file consists of a series of stanzas,
one per changer,
enclosed in curly braces.
Empty lines and lines beginning with
.Sq #
in either file are ignored.
.Pp
The following aspects may be configured:
.Bl -tag -width Ds
.It Ic drive
Provides a non-default mapping between
.Xr st 4
devices and changer drives.
For example,
to map drive 0 to rst3 and drive 1 to rst2, for changer
.Pa /dev/ch0 :
.Bd -literal -offset indent
changer ch0 {
	drive rst3
	drive rst2
}
.Ed
.El
.Sh FILES
.Bl -tag -width "/etc/chio.confXXX" -compact
.It /dev/ch0
Default changer device.
.It /etc/chio.conf
Default location for
.Xr chio 1
configuration file.
.El
.Sh SEE ALSO
.Xr chio 1 ,
.Xr mt 1
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 4.0 .
