NCommander/openbsd-src-with-branches/share/man/man4/man4.luna88k/necsb.4
.\"	$OpenBSD:$
.\"
.\" Copyright (c) 2014 Kenji Aoyama.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: December 28 2014 $
.Dt NECSB 4 luna88k
.Os
.Sh NAME
.Nm necsb
.Nd NEC PC-9801-86 sound board
.Sh SYNOPSIS
.Cd "necsb0 at cbus?"
.Cd "audio* at necsb?"
.Sh DESCRIPTION
The
.Nm
driver supports NEC PC-9801-86 sound board on
.Xr cbus 4 .
This board is a half-duplex device.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr cbus 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.7 .
.Sh BUGS
The FM synthesizer is not supported.
