NCommander/openbsd-src-with-branches/share/man/man4/man4.arm64/agtimer.4
.\"	$OpenBSD: agtimer.4,v 1.1 2016/09/18 07:03:37 jsg Exp $
.\"
.\" Copyright (c) 2016 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 18 2016 $
.Dt AGTIMER 4 arm64
.Os
.Sh NAME
.Nm agtimer
.Nd ARM generic timer
.Sh SYNOPSIS
.Cd "agtimer* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ARM generic timer, an optional extension
to the ARM architecture.
.Sh SEE ALSO
.Rs
.%T ARM Architecture Reference Manual ARMv8, for ARMv8-A architecture profile
.Re
