NCommander/openbsd-src-with-branches/share/man/man4/man4.arm64/aplaudio.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2020 Patrick Wildt <patrick@openbsd.org>
.\" Copyright (c) 2022 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt APLAUDIO 4
.Os
.Sh NAME
.Nm aplaudio
.Nd Apple audio subsystem
.Sh SYNOPSIS
.Cd "aplaudio* at fdt?"
.Cd "audio* at aplaudio?"
.Sh DESCRIPTION
.Nm
is a driver for the audio subsystem on Apple Silicon Macs.
It represents the logical connection of the DMA controller,
the MCA controller and various codecs.
.Sh SEE ALSO
.Xr apldma 4 ,
.Xr aplmca 4 ,
.Xr audio 4 ,
.Xr intro 4 ,
.Xr simplaudio 4 ,
.Xr tascodec 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
