NCommander/openbsd-src-with-branches/share/man/man4/man4.arm64/aplns.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2021 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 27 2021 $
.Dt APLNS 4 arm64
.Os
.Sh NAME
.Nm aplns
.Nd Apple NVME Storage controller
.Sh SYNOPSIS
.Cd "aplns* at fdt?"
.Cd "nvme* at aplns?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the NVME Storage controller found on
various Apple SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr nvme 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.0 .
