NCommander/openbsd-src-with-branches/share/man/man4/man4.arm64/smbios.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2019 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt SMBIOS 4 arm64
.Os
.Sh NAME
.Nm smbios
.Nd System Management BIOS
.Sh SYNOPSIS
.Cd "smbios0 at efi?"
.Sh DESCRIPTION
System Management BIOS (SMBIOS) describes hardware components.
The
.Nm
driver retrieves information about the firmware and strings identifying the
machine.
.Sh SEE ALSO
.Xr efi 4
.Rs
.%T System Management BIOS (SMBIOS) Reference Specification
.%N DMTF DSP0134
.Re
