NCommander/openbsd-src-with-branches/usr.bin/realpath/realpath.1
.\"	$OpenBSD: $
.\"
.\" Copyright (c) 2021 Klemens Nanni <kn@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 11 2021 $
.Dt REALPATH 1
.Os
.Sh NAME
.Nm realpath
.Nd print the canonicalized absolute pathname
.Sh SYNOPSIS
.Nm
.Op Fl q
.Ar file
.Sh DESCRIPTION
The
.Nm
utility uses
.Xr realpath 3
to resolve all symbolic links, extra
.Dq /
characters and references to
.Pa /./
and
.Pa /../
in
.Ar file ,
and prints the absolute pathname on standard output.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl q
Do not print errors.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr readlink 1 ,
.Xr realpath 3
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 7.1 .
