NCommander/openbsd-src-with-branches/share/man/man4/man4.sparc64/pmc.4
.\"     $OpenBSD$
.\"
.\" Copyright (c) 2007 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd April 10, 2007
.Dt PMC 4 sparc64
.Os
.Sh NAME
.Nm pmc
.Nd power management controller
.Sh SYNOPSIS
.Cd "pmc* at ebus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the watchdog feature of the power
management device of the National Semiconductor PC87317 SuperIO chip
found on UltraSPARC III systems.
.Pp
The watchdog timer provides a standard watchdog(4) interface,
and has a granularity of 60 seconds.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr bbc 4 ,
.Xr watchdog 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1 .
