NCommander/openbsd-src-with-branches/share/man/man4/man4.sparc64/radeonfb.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2009 Mark Kettenis.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt RADEONFB 4 sparc64
.Os
.Sh NAME
.Nm radeonfb
.Nd accelerated color frame buffer
.Sh SYNOPSIS
.Cd "radeonfb* at pci?"
.Cd "wsdisplay* at radeonfb?"
.Sh DESCRIPTION
The
.Nm
driver supports Sun PCI frame buffer cards based on the
ATI
.Sq Radeon
chips, such as the
Sun
XVR-100
boards.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
