NCommander/openbsd-src-with-branches/share/man/man4/man4.sparc64/vbus.4
.\"     $OpenBSD: vbus.4,v 1.3 2008/03/09 15:38:16 jmc Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 9 2008 $
.Dt VBUS 4 sparc64
.Os
.Sh NAME
.Nm vbus
.Nd virtual device bus
.Sh SYNOPSIS
.Cd "vbus0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver provides a virtual bus for devices provided by the
UltraSPARC Hypervisor as found on sun4v systems.
.Pp
.Ox
provides support for the following devices:
.Pp
.Bl -tag -width "vcons(4)XX" -offset 3n -compact
.It Xr vcons 4
virtual console interface
.It Xr vrtc 4
virtual real-time clock
.El
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
