NCommander/openbsd-src-with-branches/usr.bin/skey/skeyprune.8
.\" $OpenBSD: skeyprune.8,v 1.5 2000/03/23 21:10:18 aaron Exp $
.\"
.\"
.Dd September 27, 1996
.Dt SKEYPRUNE 8
.Os
.Sh NAME
.Nm skeyprune
.Nd prune commented out and old entries from keys file
.Sh SYNOPSIS
.Nm skeyprune
.Op Ar days
.Sh DESCRIPTION
.Nm skeyprune
searches through the S/Key database,
.Dq Pa /etc/skeykeys ,
and prunes out invalid entries (including users who have zeroed out their)
entries via
.Xr skeyinit 1 )
as well as entries that have not been modified in
.Ar days
days.
If
.Ar days
is not specified, only invalid entries are pruned.
.Sh FILES
.Bl -tag -width /etc/skeykeys -compact
.It Pa /etc/skeykeys
S/Key key information database
.El
.Sh SEE ALSO
.Xr skey 1 ,
.Xr skeyinit 1
