NCommander/openbsd-src-with-branches/usr.sbin/switchctl/switchctl.8
.\" $OpenBSD: switchctl.8,v 1.1 2016/07/19 16:54:26 reyk Exp $
.\"
.\" Copyright (c) 2007-2015 Reyk Floeter <reyk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 19 2016 $
.Dt SWITCHCTL 8
.Os
.Sh NAME
.Nm switchctl
.Nd control the SDN flow controller
.Sh SYNOPSIS
.Nm
.Op Fl q
.Op Fl s Ar socket
.Ar command
.Op Ar arg ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr switchd 8
daemon.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl q
Don't ask for confirmation of any default options.
.It Fl s Ar socket
Use
.Ar socket
instead of the default
.Pa /var/run/switchd.sock
to communicate with
.Xr switchd 8 .
.El
.Pp
The following commands are available to control
.Xr switchd 8 :
.Bl -tag -width Ds
.It Cm connect Ar address Op Cm forward-to Ar address
Connect to a new switch by
.Ar address ,
for example
.Ar 10.1.1.1 ,
or a
.Xr switch 4
control device, for example
.Pa /dev/switch0 .
.Nm switchd
will forward all OpenFlow requests of the switch to a remote controller
if the optional
.Cm forward-to
.Ar address
is specified.
.It Cm disconnect Ar address
Close the client connection to a remote switch or a
.Xr switch 4
control device.
.It Cm load Ar filename
Reload the configuration from the specified file.
.It Cm log brief
Disable verbose logging.
.It Cm log verbose
Enable verbose logging.
.It Cm monitor
Monitor internal messages of the
.Xr switchd 8
subsystems.
.It Cm show macs
Display all known mac addresses.
.It Cm show summary
Display a list of all switches and mac addresses.
.It Cm show switches
Display all known switches.
.It Cm reload
Reload the configuration from the default configuration file.
.It Cm reset all
Reset the running state.
.El
.Sh FILES
.Bl -tag -width "/var/run/switchd.sockXX" -compact
.It /etc/switchd.conf
Active configuration.
.It /var/run/switchd.sock
default
.Ux Ns -domain
socket used for communication with
.Xr switchd 8
.El
.Sh SEE ALSO
.Xr bridge 4
.Xr switchd 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 6.1 .
.Sh AUTHORS
The
.Nm
program was written by
.An Reyk Floeter Aq Mt reyk@openbsd.org .
