<!--
 - Copyright (C) 2000, 2001  Internet Software Consortium.
 - 
 - Permission to use, copy, modify, and distribute this software for any
 - purpose with or without fee is hereby granted, provided that the above
 - copyright notice and this permission notice appear in all copies.
 - 
 - THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM
 - DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL
 - IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL
 - INTERNET SOFTWARE CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT,
 - INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING
 - FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,
 - NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION
 - WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
-->
<HTML
><HEAD
><TITLE
>dig</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.61
"></HEAD
><BODY
CLASS="REFENTRY"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><H1
><A
NAME="AEN1"
>dig</A
></H1
><DIV
CLASS="REFNAMEDIV"
><A
NAME="AEN8"
></A
><H2
>Name</H2
>dig&nbsp;--&nbsp;DNS lookup utility</DIV
><DIV
CLASS="REFSYNOPSISDIV"
><A
NAME="AEN11"
></A
><H2
>Synopsis</H2
><P
><B
CLASS="COMMAND"
>dig</B
>  [@server] [<TT
CLASS="OPTION"
>-b <TT
CLASS="REPLACEABLE"
><I
>address</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-c <TT
CLASS="REPLACEABLE"
><I
>class</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-f <TT
CLASS="REPLACEABLE"
><I
>filename</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-k <TT
CLASS="REPLACEABLE"
><I
>filename</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-p <TT
CLASS="REPLACEABLE"
><I
>port#</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-t <TT
CLASS="REPLACEABLE"
><I
>type</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-x <TT
CLASS="REPLACEABLE"
><I
>addr</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-y <TT
CLASS="REPLACEABLE"
><I
>name:key</I
></TT
></TT
>] [name] [type] [class] [queryopt...]</P
><P
><B
CLASS="COMMAND"
>dig</B
>  [<TT
CLASS="OPTION"
>-h</TT
>]</P
><P
><B
CLASS="COMMAND"
>dig</B
>  [global-queryopt...] [query...]</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN51"
></A
><H2
>DESCRIPTION</H2
><P
><B
CLASS="COMMAND"
>dig</B
> (domain information groper) is a flexible tool
for interrogating DNS name servers.  It performs DNS lookups and
displays the answers that are returned from the name server(s) that
were queried.  Most DNS administrators use <B
CLASS="COMMAND"
>dig</B
> to
troubleshoot DNS problems because of its flexibility, ease of use and
clarity of output.  Other lookup tools tend to have less functionality
than <B
CLASS="COMMAND"
>dig</B
>.</P
><P
>Although <B
CLASS="COMMAND"
>dig</B
> is normally used with command-line
arguments, it also has a batch mode of operation for reading lookup
requests from a file.  A brief summary of its command-line arguments
and options is printed when the <TT
CLASS="OPTION"
>-h</TT
> option is given.
Unlike earlier versions, the BIND9 implementation of
<B
CLASS="COMMAND"
>dig</B
> allows multiple lookups to be issued from the
command line.</P
><P
>Unless it is told to query a specific name server,
<B
CLASS="COMMAND"
>dig</B
> will try each of the servers listed in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>.</P
><P
>When no command line arguments or options are given, will perform an
NS query for "." (the root).</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN65"
></A
><H2
>SIMPLE USAGE</H2
><P
>A typical invocation of <B
CLASS="COMMAND"
>dig</B
> looks like:
<PRE
CLASS="PROGRAMLISTING"
> dig @server name type </PRE
> where:

<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="CONSTANT"
>server</TT
></DT
><DD
><P
>is the name or IP address of the name server to query.  This can be an IPv4
address in dotted-decimal notation or an IPv6
address in colon-delimited notation.  When the supplied
<TT
CLASS="PARAMETER"
><I
>server</I
></TT
> argument is a hostname,
<B
CLASS="COMMAND"
>dig</B
> resolves that name before querying that name
server.  If no <TT
CLASS="PARAMETER"
><I
>server</I
></TT
> argument is provided,
<B
CLASS="COMMAND"
>dig</B
> consults <TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>
and queries the name servers listed there.  The reply from the name
server that responds is displayed.</P
></DD
><DT
><TT
CLASS="CONSTANT"
>name</TT
></DT
><DD
><P
>is the name of the resource record that is to be looked up.</P
></DD
><DT
><TT
CLASS="CONSTANT"
>type</TT
></DT
><DD
><P
>indicates what type of query is required &mdash;
ANY, A, MX, SIG, etc.
<TT
CLASS="PARAMETER"
><I
>type</I
></TT
> can be any valid query type.  If no
<TT
CLASS="PARAMETER"
><I
>type</I
></TT
> argument is supplied,
<B
CLASS="COMMAND"
>dig</B
> will perform a lookup for an A record.</P
></DD
></DL
></DIV
></P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN94"
></A
><H2
>OPTIONS</H2
><P
>The <TT
CLASS="OPTION"
>-b</TT
> option sets the source IP address of the query
to <TT
CLASS="PARAMETER"
><I
>address</I
></TT
>.  This must be a valid address on
one of the host's network interfaces.</P
><P
>The default query class (IN for internet) is overridden by the
<TT
CLASS="OPTION"
>-c</TT
> option.  <TT
CLASS="PARAMETER"
><I
>class</I
></TT
> is any valid
class, such as HS for Hesiod records or CH for CHAOSNET records.</P
><P
>The <TT
CLASS="OPTION"
>-f</TT
> option makes <B
CLASS="COMMAND"
>dig </B
> operate
in batch mode by reading a list of lookup requests to process from the
file <TT
CLASS="PARAMETER"
><I
>filename</I
></TT
>.  The file contains a number of
queries, one per line.  Each entry in the file should be organised in
the same way they would be presented as queries to
<B
CLASS="COMMAND"
>dig</B
> using the command-line interface.</P
><P
>If a non-standard port number is to be queried, the
<TT
CLASS="OPTION"
>-p</TT
> option is used.  <TT
CLASS="PARAMETER"
><I
>port#</I
></TT
> is
the port number that <B
CLASS="COMMAND"
>dig</B
> will send its queries
instead of the standard DNS port number 53.  This option would be used
to test a name server that has been configured to listen for queries
on a non-standard port number.</P
><P
>The <TT
CLASS="OPTION"
>-t</TT
> option sets the query type to
<TT
CLASS="PARAMETER"
><I
>type</I
></TT
>.  It can be any valid query type which is
supported in BIND9.  The default query type "A", unless the
<TT
CLASS="OPTION"
>-x</TT
> option is supplied to indicate a reverse lookup.
A zone transfer can be requested by specifying a type of AXFR.  When
an incremental zone transfer (IXFR) is required,
<TT
CLASS="PARAMETER"
><I
>type</I
></TT
> is set to <TT
CLASS="LITERAL"
>ixfr=N</TT
>.
The incremental zone transfer will contain the changes made to the zone
since the serial number in the zone's SOA record was
<TT
CLASS="PARAMETER"
><I
>N</I
></TT
>.</P
><P
>Reverse lookups - mapping addresses to names - are simplified by the
<TT
CLASS="OPTION"
>-x</TT
> option.  <TT
CLASS="PARAMETER"
><I
>addr</I
></TT
> is an IPv4
address in dotted-decimal notation, or a colon-delimited IPv6 address.
When this option is used, there is no need to provide the
<TT
CLASS="PARAMETER"
><I
>name</I
></TT
>, <TT
CLASS="PARAMETER"
><I
>class</I
></TT
> and
<TT
CLASS="PARAMETER"
><I
>type</I
></TT
> arguments.  <B
CLASS="COMMAND"
>dig</B
>
automatically performs a lookup for a name like
<TT
CLASS="LITERAL"
>11.12.13.10.in-addr.arpa</TT
> and sets the query type and
class to PTR and IN respectively.  By default, IPv6 addresses are
looked up using the IP6.ARPA domain and binary labels as defined in
RFC2874.  To use the older RFC1886 method using the IP6.INT domain and
"nibble" labels, specify the <TT
CLASS="OPTION"
>-n</TT
> (nibble) option.</P
><P
>To sign the DNS queries sent by <B
CLASS="COMMAND"
>dig</B
> and their
responses using transaction signatures (TSIG), specify a TSIG key file
using the <TT
CLASS="OPTION"
>-k</TT
> option.  You can also specify the TSIG
key itself on the command line using the <TT
CLASS="OPTION"
>-y</TT
> option;
<TT
CLASS="PARAMETER"
><I
>name</I
></TT
> is the name of the TSIG key and
<TT
CLASS="PARAMETER"
><I
>key</I
></TT
> is the actual key.  The key is a base-64
encoded string, typically generated by <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>dnssec-keygen</SPAN
>(8)</SPAN
>.

Caution should be taken when using the <TT
CLASS="OPTION"
>-y</TT
> option on
multi-user systems as the key can be visible in the output from
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ps</SPAN
>(1)</SPAN
> or in the shell's history file.  When
using TSIG authentication with <B
CLASS="COMMAND"
>dig</B
>, the name
server that is queried needs to know the key and algorithm that is
being used.  In BIND, this is done by providing appropriate
<B
CLASS="COMMAND"
>key</B
> and <B
CLASS="COMMAND"
>server</B
> statements in
<TT
CLASS="FILENAME"
>named.conf</TT
>.</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN144"
></A
><H2
>QUERY OPTIONS</H2
><P
><B
CLASS="COMMAND"
>dig</B
> provides a number of query options which affect
the way in which lookups are made and the results displayed.  Some of
these set or reset flag bits in the query header, some determine which
sections of the answer get printed, and others determine the timeout
and retry strategies.</P
><P
>Each query option is identified by a keyword preceded by a plus sign
(<TT
CLASS="LITERAL"
>+</TT
>).  Some keywords set or reset an option.  These may be preceded
by the string <TT
CLASS="LITERAL"
>no</TT
> to negate the meaning of that keyword.  Other
keywords assign values to options like the timeout interval.  They
have the form <TT
CLASS="OPTION"
>+keyword=value</TT
>.
The query options are:

<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="OPTION"
>+[no]tcp</TT
></DT
><DD
><P
>Use [do not use] TCP when querying name servers.  The default
behaviour is to use UDP unless an AXFR or IXFR query is requested, in
which case a TCP connection is used.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]vc</TT
></DT
><DD
><P
>Use [do not use] TCP when querying name servers.  This alternate
syntax to <TT
CLASS="PARAMETER"
><I
>+[no]tcp</I
></TT
> is provided for backwards
compatibility.  The "vc" stands for "virtual circuit".</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]ignore</TT
></DT
><DD
><P
>Ignore truncation in UDP responses instead of retrying with TCP.  By
default, TCP retries are performed.</P
></DD
><DT
><TT
CLASS="OPTION"
>+domain=somename</TT
></DT
><DD
><P
>Set the search list to contain the single domain
<TT
CLASS="PARAMETER"
><I
>somename</I
></TT
>, as if specified in a
<B
CLASS="COMMAND"
>domain</B
> directive in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>, and enable search list
processing as if the <TT
CLASS="PARAMETER"
><I
>+search</I
></TT
> option were given.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]search</TT
></DT
><DD
><P
>Use [do not use] the search list defined by the searchlist or domain
directive in <TT
CLASS="FILENAME"
>resolv.conf</TT
> (if any).
The search list is not used by default.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]defname</TT
></DT
><DD
><P
>Deprecated, treated as a synonym for <TT
CLASS="PARAMETER"
><I
>+[no]search</I
></TT
></P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]aaonly</TT
></DT
><DD
><P
>This option does nothing.  It is provided for compatibilty with old
versions of <B
CLASS="COMMAND"
>dig</B
> where it set an unimplemented
resolver flag.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]adflag</TT
></DT
><DD
><P
>Set [do not set] the AD (authentic data) bit in the query.  The AD bit
currently has a standard meaning only in responses, not in queries,
but the ability to set the bit in the query is provided for
completeness.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]cdflag</TT
></DT
><DD
><P
>Set [do not set] the CD (checking disabled) bit in the query.  This
requests the server to not perform DNSSEC validation of responses.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]recursive</TT
></DT
><DD
><P
>Toggle the setting of the RD (recursion desired) bit in the query.
This bit is set by default, which means <B
CLASS="COMMAND"
>dig</B
>
normally sends recursive queries.  Recursion is automatically disabled
when the <TT
CLASS="PARAMETER"
><I
>+nssearch</I
></TT
> or
<TT
CLASS="PARAMETER"
><I
>+trace</I
></TT
> query options are used.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]nssearch</TT
></DT
><DD
><P
>When this option is set, <B
CLASS="COMMAND"
>dig</B
> attempts to find the
authoritative name servers for the zone containing the name being
looked up and display the SOA record that each name server has for the
zone.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]trace</TT
></DT
><DD
><P
>Toggle tracing of the delegation path from the root name servers for
the name being looked up.  Tracing is disabled by default.  When
tracing is enabled, <B
CLASS="COMMAND"
>dig</B
> makes iterative queries to
resolve the name being looked up.  It will follow referrals from the
root servers, showing the answer from each server that was used to
resolve the lookup.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]cmd</TT
></DT
><DD
><P
>toggles the printing of the initial comment in the output identifying
the version of <B
CLASS="COMMAND"
>dig</B
> and the query options that have
been applied.  This comment is printed by default.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]short</TT
></DT
><DD
><P
>Provide a terse answer.  The default is to print the answer in a
verbose form.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]identify</TT
></DT
><DD
><P
>Show [or do not show] the IP address and port number that supplied the
answer when the <TT
CLASS="PARAMETER"
><I
>+short</I
></TT
> option is enabled.  If
short form answers are requested, the default is not to show the
source address and port number of the server that provided the answer.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]comments</TT
></DT
><DD
><P
>Toggle the display of comment lines in the output.  The default is to
print comments.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]stats</TT
></DT
><DD
><P
>This query option toggles the printing of statistics: when the query
was made, the size of the reply and so on.  The default behaviour is
to print the query statistics.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]qr</TT
></DT
><DD
><P
>Print [do not print] the query as it is sent.
By default, the query is not printed.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]question</TT
></DT
><DD
><P
>Print [do not print] the question section of a query when an answer is
returned.  The default is to print the question section as a comment.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]answer</TT
></DT
><DD
><P
>Display [do not display] the answer section of a reply.  The default
is to display it.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]authority</TT
></DT
><DD
><P
>Display [do not display] the authority section of a reply.  The
default is to display it.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]additional</TT
></DT
><DD
><P
>Display [do not display] the additional section of a reply.
The default is to display it.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]all</TT
></DT
><DD
><P
>Set or clear all display flags.</P
></DD
><DT
><TT
CLASS="OPTION"
>+time=T</TT
></DT
><DD
><P
>&#13;Sets the timeout for a query to
<TT
CLASS="PARAMETER"
><I
>T</I
></TT
> seconds.  The default time out is 5 seconds.
An attempt to set <TT
CLASS="PARAMETER"
><I
>T</I
></TT
> to less than 1 will result
in a query timeout of 1 second being applied.</P
></DD
><DT
><TT
CLASS="OPTION"
>+tries=T</TT
></DT
><DD
><P
>Sets the number of times to retry UDP queries to server to
<TT
CLASS="PARAMETER"
><I
>T</I
></TT
> instead of the default, 3.  If
<TT
CLASS="PARAMETER"
><I
>T</I
></TT
> is less than or equal to zero, the number of
retries is silently rounded up to 1.</P
></DD
><DT
><TT
CLASS="OPTION"
>+ndots=D</TT
></DT
><DD
><P
>Set the number of dots that have to appear in
<TT
CLASS="PARAMETER"
><I
>name</I
></TT
> to <TT
CLASS="PARAMETER"
><I
>D</I
></TT
> for it to be
considered absolute.  The default value is that defined using the
ndots statement in <TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>, or 1 if no
ndots statement is present.  Names with fewer dots are interpreted as
relative names and will be searched for in the domains listed in the
<TT
CLASS="OPTION"
>search</TT
> or <TT
CLASS="OPTION"
>domain</TT
> directive in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>.</P
></DD
><DT
><TT
CLASS="OPTION"
>+bufsize=B</TT
></DT
><DD
><P
>Set the UDP message buffer size advertised using EDNS0 to
<TT
CLASS="PARAMETER"
><I
>B</I
></TT
> bytes.  The maximum and minimum sizes of this
buffer are 65535 and 0 respectively.  Values outside this range are
rounded up or down appropriately.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]multiline</TT
></DT
><DD
><P
>Print records like the SOA records in a verbose multi-line
format with human-readable comments.  The default is to print
each record on a single line, to facilitate machine parsing 
of the <B
CLASS="COMMAND"
>dig</B
> output.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]fail</TT
></DT
><DD
><P
>Do not try the next server if you receive a SERVFAIL.  The default is
to not try the next server which is the reverse of normal stub resolver
behaviour.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]besteffort</TT
></DT
><DD
><P
>Attempt to display the contents of messages which are malformed.
The default is to not display malformed answers.</P
></DD
><DT
><TT
CLASS="OPTION"
>+[no]dnssec</TT
></DT
><DD
><P
>Requests DNSSEC records be sent by setting the DNSSEC OK bit (DO)
in the the OPT record in the additional section of the query.</P
></DD
></DL
></DIV
>&#13;</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN335"
></A
><H2
>MULTIPLE QUERIES</H2
><P
>The BIND 9 implementation of <B
CLASS="COMMAND"
>dig </B
> supports
specifying multiple queries on the command line (in addition to
supporting the <TT
CLASS="OPTION"
>-f</TT
> batch file option).  Each of those
queries can be supplied with its own set of flags, options and query
options.</P
><P
>In this case, each <TT
CLASS="PARAMETER"
><I
>query</I
></TT
> argument represent an
individual query in the command-line syntax described above.  Each
consists of any of the standard options and flags, the name to be
looked up, an optional query type and class and any query options that
should be applied to that query.</P
><P
>A global set of query options, which should be applied to all queries,
can also be supplied.  These global query options must precede the
first tuple of name, class, type, options, flags, and query options
supplied on the command line.  Any global query options (except
the <TT
CLASS="OPTION"
>+[no]cmd</TT
> option) can be
overridden by a query-specific set of query options.  For example:
<PRE
CLASS="PROGRAMLISTING"
>dig +qr www.isc.org any -x 127.0.0.1 isc.org ns +noqr</PRE
>
shows how <B
CLASS="COMMAND"
>dig</B
> could be used from the command line
to make three lookups: an ANY query for <TT
CLASS="LITERAL"
>www.isc.org</TT
>, a
reverse lookup of 127.0.0.1 and a query for the NS records of
<TT
CLASS="LITERAL"
>isc.org</TT
>.

A global query option of <TT
CLASS="PARAMETER"
><I
>+qr</I
></TT
> is applied, so
that <B
CLASS="COMMAND"
>dig</B
> shows the initial query it made for each
lookup.  The final query has a local query option of
<TT
CLASS="PARAMETER"
><I
>+noqr</I
></TT
> which means that <B
CLASS="COMMAND"
>dig</B
>
will not print the initial query when it looks up the NS records for
<TT
CLASS="LITERAL"
>isc.org</TT
>.</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN353"
></A
><H2
>FILES</H2
><P
><TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
></P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN357"
></A
><H2
>SEE ALSO</H2
><P
><SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>host</SPAN
>(1)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>named</SPAN
>(8)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>dnssec-keygen</SPAN
>(8)</SPAN
>,
<I
CLASS="CITETITLE"
>RFC1035</I
>.</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN370"
></A
><H2
>BUGS </H2
><P
>There are probably too many query options. </P
></DIV
></BODY
></HTML
>