<!--
 - Copyright (C) 2000, 2001  Internet Software Consortium.
 - 
 - Permission to use, copy, modify, and distribute this software for any
 - purpose with or without fee is hereby granted, provided that the above
 - copyright notice and this permission notice appear in all copies.
 - 
 - THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM
 - DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL
 - IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL
 - INTERNET SOFTWARE CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT,
 - INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING
 - FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,
 - NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION
 - WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
-->
<HTML
><HEAD
><TITLE
>host</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.73
"></HEAD
><BODY
CLASS="REFENTRY"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><H1
><A
NAME="AEN1"
>host</A
></H1
><DIV
CLASS="REFNAMEDIV"
><A
NAME="AEN8"
></A
><H2
>Name</H2
>host&nbsp;--&nbsp;DNS lookup utility</DIV
><DIV
CLASS="REFSYNOPSISDIV"
><A
NAME="AEN11"
></A
><H2
>Synopsis</H2
><P
><B
CLASS="COMMAND"
>host</B
>  [<TT
CLASS="OPTION"
>-aCdlnrTwv</TT
>] [<TT
CLASS="OPTION"
>-c <TT
CLASS="REPLACEABLE"
><I
>class</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-N <TT
CLASS="REPLACEABLE"
><I
>ndots</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-R <TT
CLASS="REPLACEABLE"
><I
>number</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-t <TT
CLASS="REPLACEABLE"
><I
>type</I
></TT
></TT
>] [<TT
CLASS="OPTION"
>-W <TT
CLASS="REPLACEABLE"
><I
>wait</I
></TT
></TT
>] {name} [server]</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN33"
></A
><H2
>DESCRIPTION</H2
><P
><B
CLASS="COMMAND"
>host</B
>
is a simple utility for performing DNS lookups.
It is normally used to convert names to IP addresses and vice versa.
When no arguments or options are given,
<B
CLASS="COMMAND"
>host</B
>
prints a short summary of its command line arguments and options.</P
><P
><TT
CLASS="PARAMETER"
><I
>name</I
></TT
> is the domain name that is to be looked
up.  It can also be a dotted-decimal IPv4 address or a colon-delimited
IPv6 address, in which case <B
CLASS="COMMAND"
>host</B
> will by default
perform a reverse lookup for that address.
<TT
CLASS="PARAMETER"
><I
>server</I
></TT
> is an optional argument which is either
the name or IP address of the name server that <B
CLASS="COMMAND"
>host</B
>
should query instead of the server or servers listed in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>.</P
><P
>The <TT
CLASS="OPTION"
>-a</TT
> (all) option is equivalent to setting the
<TT
CLASS="OPTION"
>-v</TT
> option and asking <B
CLASS="COMMAND"
>host</B
> to make
a query of type ANY.</P
><P
>When the <TT
CLASS="OPTION"
>-C</TT
> option is used, <B
CLASS="COMMAND"
>host</B
>
will attempt to display the SOA records for zone
<TT
CLASS="PARAMETER"
><I
>name</I
></TT
> from all the listed authoritative name
servers for that zone.  The list of name servers is defined by the NS
records that are found for the zone.</P
><P
>The <TT
CLASS="OPTION"
>-c</TT
> option instructs to make a DNS query of class
<TT
CLASS="PARAMETER"
><I
>class</I
></TT
>.  This can be used to lookup Hesiod or
Chaosnet class resource records.  The default class is IN (Internet).</P
><P
>Verbose output is generated by <B
CLASS="COMMAND"
>host</B
> when the
<TT
CLASS="OPTION"
>-d</TT
> or <TT
CLASS="OPTION"
>-v</TT
> option is used.  The two
options are equivalent.  They have been provided for backwards
compatibility.  In previous versions, the <TT
CLASS="OPTION"
>-d</TT
> option
switched on debugging traces and <TT
CLASS="OPTION"
>-v</TT
> enabled verbose
output.</P
><P
>List mode is selected by the <TT
CLASS="OPTION"
>-l</TT
> option.  This makes
<B
CLASS="COMMAND"
>host</B
> perform a zone transfer for zone
<TT
CLASS="PARAMETER"
><I
>name</I
></TT
>.  The argument is provided for
compatibility with older implementations.  This option is equivalent
to making a query of type AXFR.</P
><P
>The <TT
CLASS="OPTION"
>-n</TT
>
option specifies that reverse lookups of IPv6 addresses should
use the IP6.INT domain and "nibble" labels as defined in RFC1886.
The default is to use IP6.ARPA and binary labels as defined in RFC2874.</P
><P
>The <TT
CLASS="OPTION"
>-N</TT
> option sets the number of dots that have to be
in <TT
CLASS="PARAMETER"
><I
>name</I
></TT
> for it to be considered absolute.  The
default value is that defined using the ndots statement in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>, or 1 if no ndots statement is
present.  Names with fewer dots are interpreted as relative names and
will be searched for in the domains listed in the <SPAN
CLASS="TYPE"
>search</SPAN
>
or <SPAN
CLASS="TYPE"
>domain</SPAN
> directive in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>.</P
><P
>The number of UDP retries for a lookup can be changed with the
<TT
CLASS="OPTION"
>-R</TT
> option.  <TT
CLASS="PARAMETER"
><I
>number</I
></TT
> indicates
how many times <B
CLASS="COMMAND"
>host</B
> will repeat a query that does
not get answered.  The default number of retries is 1.  If
<TT
CLASS="PARAMETER"
><I
>number</I
></TT
> is negative or zero, the number of
retries will default to 1.</P
><P
>Non-recursive queries can be made via the <TT
CLASS="OPTION"
>-r</TT
> option.
Setting this option clears the <SPAN
CLASS="TYPE"
>RD</SPAN
> &mdash; recursion
desired &mdash; bit in the query which <B
CLASS="COMMAND"
>host</B
> makes.
This should mean that the name server receiving the query will not
attempt to resolve <TT
CLASS="PARAMETER"
><I
>name</I
></TT
>.  The
<TT
CLASS="OPTION"
>-r</TT
> option enables <B
CLASS="COMMAND"
>host</B
> to mimic
the behaviour of a name server by making non-recursive queries and
expecting to receive answers to those queries that are usually
referrals to other name servers.</P
><P
>By default <B
CLASS="COMMAND"
>host</B
> uses UDP when making queries.  The
<TT
CLASS="OPTION"
>-T</TT
> option makes it use a TCP connection when querying
the name server.  TCP will be automatically selected for queries that
require it, such as zone transfer (AXFR) requests.</P
><P
>The <TT
CLASS="OPTION"
>-t</TT
> option is used to select the query type.
<TT
CLASS="PARAMETER"
><I
>type</I
></TT
> can be any recognised query type: CNAME,
NS, SOA, SIG, KEY, AXFR, etc.  When no query type is specified,
<B
CLASS="COMMAND"
>host</B
> automatically selects an appropriate query
type.  By default it looks for A records, but if the
<TT
CLASS="OPTION"
>-C</TT
> option was given, queries will be made for SOA
records, and if <TT
CLASS="PARAMETER"
><I
>name</I
></TT
> is a dotted-decimal IPv4
address or colon-delimited IPv6 address, <B
CLASS="COMMAND"
>host</B
> will
query for PTR records.</P
><P
>The time to wait for a reply can be controlled through the
<TT
CLASS="OPTION"
>-W</TT
> and <TT
CLASS="OPTION"
>-w</TT
> options.  The
<TT
CLASS="OPTION"
>-W</TT
> option makes <B
CLASS="COMMAND"
>host</B
> wait for
<TT
CLASS="PARAMETER"
><I
>wait</I
></TT
> seconds.  If <TT
CLASS="PARAMETER"
><I
>wait</I
></TT
>
is less than one, the wait interval is set to one second.  When the
<TT
CLASS="OPTION"
>-w</TT
> option is used, <B
CLASS="COMMAND"
>host</B
> will
effectively wait forever for a reply.  The time to wait for a response
will be set to the number of seconds given by the hardware's maximum
value for an integer quantity.</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN105"
></A
><H2
>FILES</H2
><P
><TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
></P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN109"
></A
><H2
>SEE ALSO</H2
><P
><SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>dig</SPAN
>(1)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>named</SPAN
>(8)</SPAN
>.</P
></DIV
></BODY
></HTML
>
