NCommander/openbsd-src-with-branches/sbin/ipfstat/ipfstat.8
.\"	$OpenBSD: ipfstat.8,v 1.3 1996/06/23 14:30:57 deraadt Exp $
.\"
.LP
.TH ipfstat 8
.SH NAME
ipfstat - reports on packet filter statistics and filter list
.SH SYNOPSIS
ipfstat [-hIiovd:]
.SH DESCRIPTION
.LP
.PP
\fBipfstat examines /dev/kmem using the symbols \fB_fr_flags\fP,
\fB_frstats\fP, \fB_filterin\fP, and \fB_filterout\fP.
To run and work, it needs to be able to read both /dev/kmem and the
kernel itself.  The kernel name defaults to \fB_PATH_UNIX\fP and then
to \fB/bsd\fP if \fB_PATH_UNIX\fP isn't defined.
.PP
The default behaviour of \fBipfstat\fP
is to retrieve and display the accumulated statistics which have been
accumulated over time as the kernel has put packets through the filter.
.SH OPTIONS
.IP -a
display the accounting filter list and show bytes counted against each rule.
.IP -d <device>
use a device other than \fB/dev/ipl\fP for interfacing with the kernel.
.IP -f
show fragment state information (statistics) and held state information (in
the kernel) if any is present.
.IP -h
show per-rule the number of times each one scores a "hit".  For use in
combination with \fB-i\fP.
.IP -i
display the filter list used for the input side of the kernel IP processing.
.IP -I
swap between retrieving "inactive"/"active" filter list details.  For use
in combination with \fB-i\fP.
.IP -o
display the filter list used for the output side of the kernel IP processing.
.IP -s
show packet/flow state information (statistics) and held state information (in
the kernel) if any is present.
.IP -v
turn verbose mode on.  Displays more debugging information.
.SH SYNOPSIS
The role of \fBipfstat\fP is to display current kernel statistics gathered
as a result of applying the filters in place (if any) to packets going in and
out of the kernel.  This is the default operation when no command line
parameters are present.
.PP
When supplied with either \fB-i\fP or \fB-o\fP, it will retrieve and display
the appropriate list of filter rules currently installed and in use by the
kernel.
.SH FILES
/dev/kmem
/bsd
.SH SEE ALSO
ipf(1), ipfstat(1)
.SH BUGS
none known.
