NCommander/openbsd-src-with-branches/share/man/man4/man4.octeon/octcf.4
.\"	$OpenBSD: octiic.4,v 1.1 2019/04/23 13:56:51 visa Exp $
.\"
.\" Copyright (c) 2019 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 23 2019 $
.Dt OCTCF 4 octeon
.Os
.Sh NAME
.Nm octcf
.Nd OCTEON CompactFlash memory driver
.Sh SYNOPSIS
.Cd "octcf* at iobus?"
.Sh DESCRIPTION
The
.Nm
driver provides access to CompactFlash memory devices on OCTEON boot bus.
.Sh SEE ALSO
.Xr amdcf 4 ,
.Xr intro 4 ,
.Xr disklabel 5 ,
.Xr disklabel 8 ,
.Xr fdisk 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.9 .
