NCommander/openbsd-src-with-branches/share/man/man4/man4.hp300/frodo.4
.\"	$OpenBSD: frodo.4,v 1.4 2005/09/27 22:05:33 miod Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 6, 2007
.Dt FRODO 4 hp300
.Os
.Sh NAME
.Nm frodo
.Nd Apollo Utility Chip
.Sh SYNOPSIS
.Cd "frodo0 at intio?"
.Cd "apci* at frodo?"
.Cd "dnkbd0 at frodo?"
.Cd "isabr0 at frodo?"
.Sh DESCRIPTION
The
.Tn FRODO
ASIC (or
.Dq Apollo Utility chip )
is found on HP 9000/4xx series workstations,
as well as HP 9000/362 and HP 9000/382 workstations.
It provides four
.Xr apci 4
serial ports, the first one being used to connect the
Domain keyboard.
On system with ISA slots,
.Nm
also provides ISA interrupt logic.
.Sh SEE ALSO
.Xr apci 4 ,
.Xr dnkbd 4 ,
.Xr intro 4 ,
.Xr isabr 4
