NCommander/openbsd-src-with-branches/share/man/man4/man4.hp300/hyper.4
.\"	$OpenBSD: hyper.4,v 1.7 2005/01/14 22:39:21 miod Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 12, 2005
.Dt HYPER 4 hp300
.Os
.Sh NAME
.Nm hyper
.Nd
.Tn HP A1096A
Hyperion frame buffer
.Sh SYNOPSIS
.Cd "hyper*     at dio?"
.Cd "wsdisplay* at hyper?"
.Sh DESCRIPTION
The Hyperion is a monochrome, high-resolution frame buffer.
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr wscons 4
console framework.
.Sh SELECT CODE
The
.Dq select code
for the Hyperion card can be set with the JP01 and JP02 jumpers.
These jumpers are located in the upper right corner of the board, when it is
placed component side up, with the video connector to the left.
Numbering the jumper pins from 1 to 3 from left to right,
the following combinations are available:
.Bl -column "JP02" "JP01" -offset indent
.It Sy "JP02" Ta Sy "JP01" Ta Sy "Select code"
.It " "
.It Li "1-2" Ta "1-2" Ta 135
.It Li "1-2" Ta "2-3" Ta 134
.It Li "2-3" Ta "1-2" Ta "133 (factory settings)"
.It Li "2-3" Ta "2-3" Ta 132
.El
.Pp
Leaving a jumper open is equivalent to shorting pins 1 and 2.
.Sh SEE ALSO
.Xr dvbox 4 ,
.Xr gbox 4 ,
.Xr intro 4 ,
.Xr rbox 4 ,
.Xr sti 4 ,
.Xr topcat 4 ,
.Xr tvrx 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
