NCommander/openbsd-src-with-branches/share/man/man4/man4.loongson/sisfb.4
.\"	$OpenBSD: sisfb.4,v 1.1 2010/02/28 22:32:50 miod Exp $
.\"
.\" Copyright (c) 2010 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 28 2010 $
.Dt SISFB 4 loongson
.Os
.Sh NAME
.Nm sisfb
.Nd SiS 315 Pro frame buffer
.Sh SYNOPSIS
.Cd "sisfb* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports the SiS 315 Pro frame buffer.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework, as a
.Xr wsdisplay 4
device.
.Pp
The PMON firmware initializes the frame buffer in a VGA compatible video mode,
either with a 640x400 resolution and 8 bits per pixel on Fuloong,
or a 1360x768 resolution and 16 bits per pixel on Lynloong.
It is currently not possible to change the frame buffer resolution and
color depth.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
