NCommander/openbsd-src-with-branches/share/man/man4/man4.sgi/iof.4
.\"	$OpenBSD: iof.4,v 1.3 2009/10/08 20:06:38 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 8 2009 $
.Dt IOF 4 sgi
.Os
.Sh NAME
.Nm iof
.Nd IOC4 generic workstation I/O device
.Sh SYNOPSIS
.Cd "iof* at pci?"
.Cd "com0 at iof? base 0x380"
.Cd "com* at iof?"
.Cd "dsrtc0 at iof?"
.\" .Cd "iockbc* at iof?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SGI IOC4-based basic I/O device on Origin 350
and Tezro systems.
.Pp
The IOC4 chip provides:
.Pp
.Bl -tag -width 10n -offset ind -compact
.It Xr com 4
Four serial ports.
.It Xr dsrtc 4
Time-of-day chip.
.\" .It Xr iockbc 4
.\" PS/2 keyboard and mouse interface.
.It Xr pciide 4
PCI IDE controller driver.
.El
.Sh SEE ALSO
.Xr com 4 ,
.\" .Xr dsrtc 4 ,
.Xr intro 4 ,
.\" .Xr iockbc 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.6 .
.Sh BUGS
Neither the PS/2 keyboard and mouse interface nor the ATAPI interface
are supported yet.
.\" .Sh AUTHORS
.\" The
.\" .Nm
.\" driver was written by
.\" .An Miod Vallat .
