NCommander/openbsd-src-with-branches/share/man/man4/man4.sgi/mec.4
.\"	$OpenBSD: mec.4,v 1.3 2004/08/27 13:30:57 miod Exp $
.\"
.\"	Written by Michael Shalayeff, 2004. Public Domain.
.\"
.Dd August 10, 2004
.Dt MEC 4 sgi
.Os
.Sh NAME
.Nm mec
.Nd MAC-110 Ethernet controller
.Sh SYNOPSIS
.Cd "mec0 at macebus0 sys 0x18 base 0x00280000 irq 4"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MAC-110 Fast Ethernet controller
found on
.Tn O2
machines.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr intro 4 ,
.Xr macebus 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.6 .
.Sh AUTHORS
The
.Nm
device driver was written by Izumi Tsutsui and Christopher SEKIYA.
The
.Ox
port was done by Michael Shalayeff.
