NCommander/openbsd-src-with-branches/share/man/man5/mixerctl.conf.5
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2004 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 20, 2004
.Dt MIXERCTL.CONF 5
.Os
.Sh NAME
.Nm mixerctl.conf
.Nd mixerctl variables to set at system startup
.Sh DESCRIPTION
.Nm
contains a list of
.Xr mixerctl 1
variable assignments that is read at system startup by
.Xr rc 8
early on in the boot sequence.
.Pp
The file is made up of
.Xr mixerctl 1
variable assignments
.Pq Ar variable Ns = Ns Ar value
with comments designated by a hash mark
.Pq Sq # .
.Sh FILES
.Bl -tag -width /etc/mixerctl.conf -compact
.It Pa /etc/mixerctl.conf
.El
.Sh EXAMPLES
To turn on the line in input, use the following line:
.Bd -literal -offset indent
inputs.line.mute=off
.Ed
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr rc 8
