NCommander/openbsd-src-with-branches/usr.sbin/rcctl/rcctl.8
.\"	$OpenBSD: rcctl.8,v 1.3 2014/08/19 17:45:43 schwarze Exp $
.\"
.\" Copyright (c) 2014 Antoine Jacoutot <ajacoutot@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 19 2014 $
.Dt RCCTL 8
.Os
.Sh NAME
.Nm rcctl
.Nd configure and control daemons and services
.Sh SYNOPSIS
.Nm rcctl
.Sm off
.Cm enable | disable | status | Ar action
.Sm on
.Op Ar service | daemon Op Cm flags Op Ar arguments
.Sh DESCRIPTION
The
.Nm
utility can enable or disable a base system
.Ar service
or a base system or package
.Ar daemon
in
.Xr rc.conf.local 8
or display its status.
For a daemon, it can also change the command line arguments or call its
.Xr rc.d 8
.Ar daemon
control script.
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm enable Ar service | daemon Op Cm flags Op Ar arguments
Enable the service or daemon in
.Xr rc.conf.local 8 .
For a daemon, optionally set the variable
.Ar daemon Ns _flags
to the specified
.Ar arguments .
If
.Cm flags
is appended without any
.Ar arguments ,
.Ar daemon Ns _flags
is reset to its default value.
.It Cm disable Ar service | daemon
Disable the service or daemon in
.Xr rc.conf.local 8 .
.It Cm status Op Ar service | daemon
Display the value of
.Ar service
or
.Ar daemon Ns _flags .
Without an argument, list all services and daemons
with their current status and flags.
.It Ar action daemon
Run the
.Xr rc.d 8
.Ar daemon
script with the
.Ar action
argument.
.El
.Sh EXIT STATUS
.Nm Ar action
returns with the exit status of the
.Xr rc.d 8
.Ar daemon
script.
.Nm Cm status
exits with 0 if the daemon or service is enabled and 1 if it is not.
Otherwise, the
.Nm
utility exits 0 on success, and >0 if an error occurs.
.Sh EXAMPLES
Disable
.Xr ntpd 8
and check its status:
.Bd -literal -offset indent
# rcctl disable ntpd
# rcctl status ntpd
NO
# echo $?
1
.Ed
.Pp
Enable and set
.Xr ntpd 8
flags:
.Bd -literal -offset indent
# rcctl enable ntpd flags -s
# rcctl status ntpd
-s
# echo $?
0
.Ed
.Pp
Start
.Xr ntpd 8
and check that it is running:
.Bd -literal -offset indent
# rcctl start ntpd
ntpd(ok)
# rcctl check ntpd
ntpd(ok)
# echo $?
0
.Ed
.Sh SEE ALSO
.Xr rc.conf.local 8 ,
.Xr rc.d 8
.Sh HISTORY
.Nm
first appeared in
.Ox 5.7 .
.Sh AUTHORS
.Nm
was written by
.An Antoine Jacoutot Aq Mt ajacoutot@openbsd.org .
