NCommander/openbsd-src-with-branches/usr.sbin/sendmail/praliases/praliases.8
.\"
.\" $OpenBSD: $
.\"
.Dd Sep 14, 1996
.Dt PRALIASES 1
.Os BSD 4
.Sh NAME
.Nm praliases
.Nd look up aliases in the aliases file
.Sh SYNOPSIS
.Nm praliases
.Op Fl f Ar file
.Op key ...
.Sh DESCRIPTION
.Nm Praliases
looks up the specified aliases in the
system-wide aliases file.
With no arguments,
.Nm praliases
prints out the entire aliases file.
.Pp
When given the
.Fl f
option,
.Nm
looks up aliases in the specified
.Ar file
instead of the default system-wide aliases file.  Note
that this must be the database version created by:
.Pp
.Bd -literal -offset indent -compact
.Pa /usr/sbin/sendmail Fl bi oA Ar file
.Ed
.Sh BUGS
.Nm Praliases
only will only lookup aliases in the database version of
the aliases file.  It does not look up aliases in the
raw aliases file, nor does it look in
.Pa /etc/sendmail.cf
for the paths to other aliases files or network-based
databases such as NIS, NetInfo, or Hesiod.
.Sh FILES
.Bl -tag -width /etc/aliases.db -compact
.It Pa /etc/aliases
raw data for alias names
.It Pa /etc/aliases.db
data base of alias names
.Sh SEE ALSO
.Xr newaliases 1 ,
.Xr aliases 5 ,
.Xr sendmail 8 .
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
