NCommander/openbsd-src-with-branches/sbin/ipsecctl/ipsecctl.8
.\"	$OpenBSD: ipsecctl.8,v 1.2 2005/04/04 22:22:55 hshoexer Exp $
.\"
.\" The following requests are required for all man pages.
.Dd April, 5, 2005
.Dt IPSECCTL 8 
.Os
.Sh NAME
.Nm ipsecctl
.Nd "control flows for IPsec
.Sh SYNOPSIS
.\" For a program:  program [-abc] file ...
.Nm ipsecctl
.Op Fl Fhnvs
.Op Fl f Ar file
.Sh DESCRIPTION
The
.Nm
utility controls flows that determining which packets are to be processed by
IPsec.
It allows ruleset configuration and retrieval of status information from the
kernels SPD (Security Policy Database).
.Pp
The ruleset grammar is described in
.Xr ipsec.conf 5 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f Ar file
Load the rules contained in
.Ar file .
.It Fl F
The
.Fl F
option flushes the SPD.
.It Fl h
Help.
.It Fl n
Do not actually load rules, just parse them.
.It Fl v
Produce more verbose output.
A second use of
.Fl v
will produce even more verbose output.
.It Fl s
Show the ruleset loaded into the SPD.

.\" The following requests should be uncommented and used where appropriate.
.\" This next request is for sections 2, 3, and 9 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only.
.\" .Sh ENVIRONMENT
.\" .Sh FILES
.\" .Sh EXAMPLES
.\" This next request is for sections 1, 4, 6, and 8 only.
.\" .Sh DIAGNOSTICS
.\" The next request is for sections 2, 3, and 9 error and signal handling only.
.\" .Sh ERRORS
.\" .Sh SEE ALSO
.\" .Xr foobar 1
.\" .Sh STANDARDS
.\" .Sh HISTORY
.\" .Sh AUTHORS
.\" .Sh CAVEATS
.\" .Sh BUGS
