NCommander/openbsd-src-with-branches/share/man/man4/man4.i386/ie.4
.\"	$OpenBSD: ie.4,v 1.12 2005/04/05 06:47:32 jmc Exp $
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 10, 1995
.Dt IE 4 i386
.Os
.Sh NAME
.Nm ie
.Nd Intel i82586 Ethernet driver
.Sh SYNOPSIS
.Cd "ie0 at isa? port 0x360 irq 7 iomem 0xd0000"
.Cd "ie1 at isa? port 0x300 irq 10"
.Sh DESCRIPTION
The
.Nm
device driver supports Intel 82586-based Ethernet cards.
This includes the following network adapters:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It 3Com 3C507
.It AT&T StarLAN 10
.It AT&T EN100
.It AT&T StarLan Fiber
.It Intel EtherExpress 16
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
To view a list of media types and options supported by your card try
.Dq ifconfig -m <device> .
For example,
.Dq ifconfig -m ie0 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
