NCommander/openbsd-src-with-branches/share/man/man4/man4.i386/scd.4
.\" $OpenBSD: scd.4,v 1.3 1999/07/09 13:35:44 aaron Exp $
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd March 5, 1996
.Dt SCD 4 i386
.Os
.Sh NAME
.Nm scd
.Nd Sony CD-ROM driver
.Sh SYNOPSIS
.Cd "scd0 at isa? port 0x340"
.Sh DESCRIPTION
The
.Nm
driver provides support for Sony CD-ROM drives and controllers.
Supported drives are CDU-31A and CDU-33A.
.Pp
.Sh FILES
.Bl -tag -width /dev/rscd* -compact
.It Pa /dev/scd*
.It Pa /dev/rscd*
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr intro 4 ,
.Xr mcd 4
