NCommander/openbsd-src-with-branches/share/man/man4/man4.armv7/armliicc.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2016 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt ARMLIICC 4 armv7
.Os
.Sh NAME
.Nm armliicc
.Nd ARM PL310 L2 cache controller
.Sh SYNOPSIS
.Cd "armliicc* at cortex?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ARM PL310 level two cache controller
integrated into Cortex-A9.
.Sh SEE ALSO
.Xr cortex 4
.Rs
.%T PL310 Cache Controller Technical Reference Manual
.Re
