NCommander/openbsd-src-with-branches/share/man/man4/man4.armv7/plrtc.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2015 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt PLRTC 4 armv7
.Os
.Sh NAME
.Nm plrtc
.Nd ARM PrimeCell PL031 Real-time clock
.Sh SYNOPSIS
.Cd "plrtc* at vexpress?"
.Sh DESCRIPTION
The
.Nm
driver supports the ARM PrimeCell PL031 real-time clock.
.Sh SEE ALSO
.Xr vexpress 4
.Rs
.%T ARM PrimeCell Real Time Clock (PL031) Technical Reference Manual
.%V ARM DDI 0224
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.8 .
