NCommander/openbsd-src-with-branches/share/man/man4/man4.sparc/presto.4
.\"	$OpenBSD: presto.4,v 1.5 2010/07/11 07:37:30 jmc Exp $
.\" Copyright (c) 2003, Miodrag Vallat
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 11 2010 $
.Dt PRESTO 4 sparc
.Os
.Sh NAME
.Nm presto
.Nd Prestoserve battery-backed memory
.Sh SYNOPSIS
.Cd "presto* at sbus?"
.Cd "presto* at mainbus?" Pq "SS10/SS20 NVSIMM"
.Sh DESCRIPTION
The
.Tn Legato
Prestoserve NVRAM SBus cards and NVSIMM used to be part of the
.Dq NFS accelerator
product, which used the device's memory as an NFS-dedicated cache, increasing
performance of NFS servers exporting filesystem as NFS protocol, version 2.
.Pp
The
.Nm
driver does not attempt to achieve such a behaviour, which is questionable
with the advent of NFS protocol, version 3.
.Pp
Instead, it will provide direct access to the NVRAM, as a block device.
.Sh FILES
.Bl -tag -width /dev/rprestoXXXXX -compact
.It Pa /dev/presto Ns Ar u Ns Ar p
block mode Prestoserve card number
.Ar u ,
partition
.Ar p
.It Pa /dev/rpresto Ns Ar u Ns Ar p
raw mode Prestoserve card number
.Ar u ,
partition
.Ar p
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr disklabel 5 ,
.Xr disklabel 8 ,
.Xr MAKEDEV 8
