NCommander/openbsd-src-with-branches/share/man/man4/man4.sparc/xbox.4
.\"     $OpenBSD: xbox.4,v 1.5 2004/09/30 19:59:27 mickey Exp $
.\"
.\" Copyright (c) 1999 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate$
.Dt XBOX 4 sparc
.Os
.Sh NAME
.Nm xbox
.Nd SPARC SBus Expansion Subsystem
.Sh SYNOPSIS
.Cd "xbox*   at sbus?   " Pq "sun4c/sun4m"
.Cd "sbus*   at xbox?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Sun SBus Expansion Subsystem.
This device consists of an SBus card and a chassis which has
three additional SBus slots.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sbus 4
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 2.6 .
