NCommander/openbsd-src-with-branches/share/man/man4/acpithinkpad.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2008 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt ACPITHINKPAD 4
.Os
.Sh NAME
.Nm acpithinkpad
.Nd IBM/Lenovo Thinkpad ACPI support
.Sh SYNOPSIS
.Cd "acpithinkpad* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides ACPI support for IBM/Lenovo Thinkpad laptops.
It responds to various hotkey button presses such as the brightness adjustment
and wireless toggle keys.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
