NCommander/openbsd-src-with-branches/share/man/man4/acpiasus.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2008 Joel Sing (jsing@openbsd.org)
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt ACPIASUS 4
.Os
.Sh NAME
.Nm acpiasus
.Nd ASUS ACPI hotkeys
.Sh SYNOPSIS
.Cd "acpiasus* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ACPI based hotkeys found in many ASUS laptops,
including the ASUS EeePC.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by Jared D. McNeill and was ported to
.Ox
by
.An Joel Sing Aq jsing@openbsd.org .
