NCommander/openbsd-src-with-branches/share/man/man4/acpithinkpad.4
.\"	$OpenBSD: acpithinkpad.4,v 1.2 2008/05/31 22:02:03 sobrado Exp $
.\"
.\" Copyright (c) 2008 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2008 $
.Dt ACPITHINKPAD 4
.Os
.Sh NAME
.Nm acpithinkpad
.Nd IBM/Lenovo ThinkPad ACPI support
.Sh SYNOPSIS
.Cd "acpithinkpad* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides ACPI support for IBM/Lenovo ThinkPad laptops.
It responds to various hotkey button presses such as the brightness adjustment
and wireless toggle keys.
.Pp
The
.Nm
driver sets up various sensor devices that indicate the current state of
certain hardware devices present on ThinkPad laptops. These include
temperature sensors and fan rotational speed sensors, as well as a
sensor indicating the current state of the port replicator device.
These sensors can be used with
.Xr sensorsd 8
to perform events on sensor state changes. Note that the port replicator
indicator will report a state of UNKNOWN until the first port replicator
connect/disconnect event is received.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4 ,
.Xr sensorsd 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
