NCommander/openbsd-src-with-branches/share/man/man4/amdgpio.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2019 James Hastings
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt AMDGPIO 4
.Os
.Sh NAME
.Nm amdgpio
.Nd AMD GPIO controller
.Sh SYNOPSIS
.Cd "amdgpio* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the GPIO controller found on AMD chipsets. 
It does not provide direct device driver entry points but makes its
functions available to
.Xr acpi 4 .
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An James Hastings
based on the
.Xr bytgpio 4
driver by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
