NCommander/openbsd-src-with-branches/share/man/man4/bcmbsc.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt BCMBSC 4
.Os
.Sh NAME
.Nm bcmbsc
.Nd Broadcom Serial Control controller
.Sh SYNOPSIS
.Cd "bcmbsc* at fdt?"
.Cd "iic* at bcmbsc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Broadcom Serial Control controller
integrated on Broadcom BCM283x and BCM2711 SoCs.
The Broadcom Serial Controller bus is compatible with the I2C bus and
can be used to connect standard I2C slave devices.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
