NCommander/openbsd-src-with-branches/share/man/man4/cduart.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2021 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt CDUART 4
.Os
.Sh NAME
.Nm cduart
.Nd Cadence Universal Asynchronous Receiver/Transmitter
.Sh SYNOPSIS
.Cd "cduart* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the Cadence Universal Asynchronous
Receiver/Transmitter (UART).
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.0 .
