NCommander/openbsd-src-with-branches/share/man/man4/ciss.4
.\"	$OpenBSD: ciss.4,v 1.4 2006/01/07 21:55:02 brad Exp $
.\"
.\" Michael Shalayeff, 2005. Public Domain.
.\"
.Dd August 2, 2005
.Dt CISS 4
.Os
.Sh NAME
.Nm ciss
.Nd Compaq Smart ARRAY 5/6 RAID controllers
.Sh SYNOPSIS
.Cd "ciss* at pci?"
.Cd "scsibus* at ciss?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Compaq Smart ARRAY 5th and 6th
family of RAID controllers, including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Compaq 532, 5300, 5312, 5i
.It Compaq 641, 642, 6400, 6400EM, 6422
.It Hewlett-Packard V100, P800, P600, E400, 6i
.El
.Pp
These controllers support RAID 0, RAID 1, RAID 5, JBOD,
and superpositions of those configurations.
.Pp
Although the controllers are actual RAID controllers,
the driver makes them look just like SCSI controllers.
All RAID configuration is done through the controllers' BIOSes.
.Pp
Monitoring status for the volume and drives in it is done through
.Xr bioctl 8
utility and also current status is provided in
.Dq hw.sensors
variables as given by the 
.Xr sysctl 8 .
.Sh SEE ALSO
.Xr bio 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr bioctl 8 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@openbsd.org .
.Sh CAVEATS
For purposes of status monitoring current code supports one logical
volume per controller only.
