NCommander/openbsd-src-with-branches/share/man/man4/dwiic.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2016 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt DWIIC 4
.Os
.Sh NAME
.Nm dwiic
.Nd Synopsys DesignWare I2C controller
.Sh SYNOPSIS
.Cd "dwiic* at acpi?"
.Cd "iic* at dwiic?"
.Sh DESCRIPTION
The
.Nm
driver supports the Synopsys DesignWare I2C controller for use
with the
.Xr iic 4
framework.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr iic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.9 .
