NCommander/openbsd-src-with-branches/share/man/man4/gfrtc.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2021 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt GFRTC 4
.Os
.Sh NAME
.Nm gfrtc
.Nd Google Goldfish real-time clock
.Sh SYNOPSIS
.Cd "gfrtc* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the real-time clock interface of Google's Goldfish
Android virtual hardware platform.
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.0 .
