NCommander/openbsd-src-with-branches/share/man/man4/hme.4
.\"     $OpenBSD: hme.4,v 1.12 2009/01/20 08:12:35 jmc Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 20 2009 $
.Dt HME 4
.Os
.Sh NAME
.Nm hme
.Nd Sun Happy Meal 10/100 Ethernet device
.Sh SYNOPSIS
.Cd "hme* at pci?"
.Cd "hme* at sbus?"
.Cd "luphy* at mii?"
.Cd "nsphy* at mii?"
.Cd "qsphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for various NICs based on the Sun Happy Meal Ethernet
controller chips, including the following:
.Pp
.Bl -bullet -compact -offset indent
.It
Sun FastEthernet PCI
.It
Sun FastEthernet SBus
.It
Sun Quad FastEthernet PCI
.It
Sun Quad FastEthernet SBus
.It
Sun SunSwift PCI
.It
Sun SunSwift SBus
.El
.Pp
The
.Nm
driver supports several media types, which are selected via the
.Xr ifconfig 8
command.
The supported media types are:
.Bl -tag -width "media autoselect" -offset indent
.It media autoselect
Attempt to autoselect the media type (default)
.It media 100baseTX mediaopt full-duplex
Use 100baseTX, full duplex
.It media 100baseTX
Use 100baseTX, half duplex
.It media 10baseT mediaopt full-duplex
Use 10baseT, full duplex
.It media 10baseT
Use 10baseT, half duplex
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr be 4 ,
.Xr ie 4 ,
.Xr ifmedia 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr le 4 ,
.Xr luphy 4 ,
.Xr netintro 4 ,
.Xr qe 4 ,
.Xr sbus 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Rs
.%T "STP2002QFP Fast Ethernet, Parallel Port, SCSI (FEPS) User's Guide"
.%D April 1996
.%A Sun Microelectronics
.Re
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 2.4 .
.Sh CAVEATS
The
.Nm
SBus cards will not function in a sun4c class machine,
due to PROM limitations.
