NCommander/openbsd-src-with-branches/share/man/man4/hvn.4
.\"	$OpenBSD: hvn.4,v 1.2 2016/09/15 17:18:35 jmc Exp $
.\"
.\" Copyright (c) 2016 Mike Belopuhov
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 15 2016 $
.Dt HVN 4
.Os
.Sh NAME
.Nm hvn
.Nd Hyper-V networking interface
.Sh SYNOPSIS
.Cd "hvn* at hyperv?"
.Sh DESCRIPTION
The
.Nm
driver provides support for a Network Virtual Service Client (NetVSC),
a virtual networking interface that relays device requests to the Virtual
Service Provider (VSP) in the management operating system via the VMBus.
.Pp
NetVSC emulates an RNDIS 1.0 compliant device on top of a custom NVS
protocol operating over the VMBus channel ring.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr hyperv 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mike Belopuhov Aq Mt mikeb@openbsd.org
based on the
.Fx
driver by the Microsoft BSD Integration Services Team
.Aq Mt bsdic@microsoft.com .
