NCommander/openbsd-src-with-branches/share/man/man4/hvs.4
.\"	$OpenBSD: xbf.4,v 1.2 2016/12/07 17:11:09 jmc Exp $
.\"
.\" Copyright (c) 2017 Mike Belopuhov
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 7 2016 $
.Dt HVS 4
.Os
.Sh NAME
.Nm hvs
.Nd Hyper-V virtual disk
.Sh SYNOPSIS
.Cd "hvs* at hyperv?"
.Sh DESCRIPTION
The
.Nm
driver provides support for a Storage Virtual Service Client (StorVSC),
a virtual disk interface that relays device requests to the Virtual
Service Provider (VSP) in the management operating system via the VMBus.
.Pp
StorVSC provides a unified interface to emulated IDE and SCSI devices.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr hyperv 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mike Belopuhov Aq Mt mikeb@openbsd.org
based on the
.Fx
driver by the Microsoft BSD Integration Services Team
.Aq Mt bsdic@microsoft.com .
