NCommander/openbsd-src-with-branches/share/man/man4/imxsrc.4
.\"	$OpenBSD: imxgpc.4,v 1.1 2018/04/01 09:03:25 jsg Exp $
.\"
.\" Copyright (c) 2019 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 1 2018 $
.Dt IMXSRC 4
.Os
.Sh NAME
.Nm imxsrc
.Nd i.MX System Reset Controller
.Sh SYNOPSIS
.Cd "imxsrc* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the i.MX System Reset Controller (SRC).
It registers as reset controller so that drivers can reset devices
by asserting their reset pins.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
