NCommander/openbsd-src-with-branches/share/man/man4/ioprbs.4
.\"	$OpenBSD: ioprbs.4,v 1.10 2003/06/06 10:29:41 jmc Exp $
.\"
.\" Copyright (c) 2000 Niklas Hallqvist <niklas@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd July 4, 2001
.Dt IOPRBS 4
.Os
.Sh NAME
.Nm ioprbs
.Nd I2O random block storage
.Sh SYNOPSIS
.Cd "ioprbs* at iop? tid ?"
.Cd "scsibus* at ioprbs?"
.Sh DESCRIPTION
The
.Nm
driver provides support for I2O random block storages, like RAID-sets.
So far only the following adapters has been tested:
.Pp
.Bl -item -offset indent -compact
.It
.Tn Adaptec 2100S
.It
.Tn Adaptec 2110S
.It
.Tn Adaptec 3200S
.El
.Pp
Although only those two adapters have been tested, the I2O interface is
a generic one, and the driver should cope with all I2O random block
storages with no further adaptions.
.Pp
The storage is presented to the system as SCSI disks for uniformity
with other RAID controllers we support.
All RAID configuration is done through the controllers' BIOSes.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr iop 4 ,
.Xr iopsp 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Niklas Hallqvist Aq niklas@openbsd.org ,
inspired by the
.Nx
ld_iop driver by
.An Andrew Doran Aq ad@netbsd.org .
