NCommander/openbsd-src-with-branches/share/man/man4/iosf.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2023 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 16 2017 $
.Dt IOSF 4
.Os
.Sh NAME
.Nm iosf
.Nd Intel OnChip System Fabric device
.Sh SYNOPSIS
.Cd "iosf* at acpi?"
.Cd "iosf* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support routines for platforms using the
Intel OnChip System Fabric.
.Pp
The
.Xr dwiic 4
driver uses the MailBox Interface (MBI) provided by
.Nm
to coordinate access to I2C devices.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr dwiic 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An David Gwynne Aq Mt dlg@openbsd.org .
