NCommander/openbsd-src-with-branches/share/man/man4/maxrtc.4
.\"	$OpenBSD: maxrtc.4,v 1.3 2022/10/24 18:34:29 mglocker Exp $
.\"
.\" Copyright (c) 2006 Theo de Raadt <deraadt@openbsd.org>
.\" Copyright (c) 2016 Marcus Glocker <mglocker@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 24 2022 $
.Dt MAXRTC 4
.Os
.Sh NAME
.Nm maxrtc
.Nd Maxim DS1307/DS1339 real-time clock
.Sh SYNOPSIS
.Cd "maxrtc* at iic?"
.Sh DESCRIPTION
The
.Nm
driver supports the Maxim DS1307 and DS1339 real-time clock chips,
which provide a low-power, full binary-coded decimal (BCD) clock/calendar.
In addition, the DS1307 comes with 56 bytes of NV SRAM.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marcus Glocker Aq Mt mglocker@openbsd.org .
