NCommander/openbsd-src-with-branches/share/man/man4/mbg.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2006 Marc Balmer <mbalmer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 24, 2006
.Dt MBG 4
.Os
.Sh NAME
.Nm mbg
.Nd Meinberg Funkuhren time signal station receiver
.Sh SYNOPSIS
.Cd "mbg* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Meinberg Funkuhren time signal station receiver
cards.
.Pp
Currently, only the DCF77 PCI32 card is supported by
.Nm .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Marc Balmer Aq mbalmer@openbsd.org .
