NCommander/openbsd-src-with-branches/share/man/man4/mlphy.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2011 Loganaden V. Velvindron <loganaden@devio.us>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate$
.Dt MLPHY 4
.Os
.Sh NAME
.Nm mlphy
.Nd MicroLinear 6692 Ethernet PHY
.Sh SYNOPSIS
.Cd "mlphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports MicroLinear 6692 10/100 Ethernet PHYs.
The MicroLinear PHY only supports 100baseTX operation but can advertise
10baseT operation for a possible companion PHY.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr ifconfig 8
.Sh BUGS
The OUI and device identification of the MicroLinear 6692 PHY are
undefined and so
.Nm
only attaches to
.Xr tl 4
devices using the
.Xr tlphy 4
as companion PHY.
