NCommander/openbsd-src-with-branches/share/man/man4/nmea.4
.\"	$OpenBSD: nmea.4,v 1.1 2006/06/01 20:10:28 mbalmer Exp $
.\"
.\" Copyright (c) 2006 Marc Balmer <mbalmer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 42, 2006
.Dt NMEA 4
.Os
.Sh NAME
.Nm nmea
.Nd line discipline for NMEA0183 devices
.Sh SYNOPSIS
.Cd "pseudo-device nmea" Op Ar count
.Sh DESCRIPTION
This line discipline provides an interface to NMEA talking devices
which are connected to a host through a serial line.
.Pp
The line discipline is enabled by the following sequence:
.Bd -literal -offset indent
#include <sys/ttycom.h>
int ldisc = NMEADISC, fildes; ...
ioctl(fildes, TIOCSETD, &ldisc);
.Ed
.Pp
While applications can still use the device as if it had the
default (termios) line discipline attached, the line discipline
maintains a timedelta sensor in the kernel.
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
interface appeared in
.Ox 4.0 .
.Sh AUTHORS
The
.Nm
line discipline was written by
.An Marc Balmer Aq mbalmer@openbsd.org .
