NCommander/openbsd-src-with-branches/share/man/man4/pckbc.4
.\" $OpenBSD: pckbc.4,v 1.2 2000/12/21 21:01:18 aaron Exp $
.\" $NetBSD: pckbc.4,v 1.2 2000/06/16 06:42:31 augustss Exp $
.\"
.Dd April 21, 1999
.Dt PCKBC 4
.Os
.Sh NAME
.Nm pckbc
.Nd PC (ISA) keyboard controller driver
.Sh SYNOPSIS
.Cd "pckbc* at isa?"
.Cd "pckbc* at pnpbios? index ?"
.Cd "pckbd* at pckbc? slot ?"
.Cd "pms*   at pckbc? slot ?"
.Cd "pmsi*  at pckbc? slot ?"
.Cd "opms*  at pckbc? slot ?"
.Sh DESCRIPTION
The
.Nm
driver handles ressource allocation and device attachment for the
traditional PC/AT keyboard controller.
It provides two logical connections for child devices, the
.Dq keyboard
slot for a keyboard and the
.Dq auxillary
slot for mice (the latter might be missing in older keyboard controllers).
.Pp
The optional
.Dq slot
locator argument can be used to force unusual connections of devices to
logical slots.
This feature is for experimentation only, it will not be
useful in normal operation.
.Sh SEE ALSO
.Xr isa 4 ,
.Xr pckbd 4
.\" .Xr pms 4 ,
.\" .Xr pmsi 4 ,
.\" .Xr pnpbios 4 ,
.\" .Xr opms 4 .
