NCommander/openbsd-src-with-branches/share/man/man4/pcppi.4
.\" $OpenBSD: pcppi.4,v 1.7 2004/03/22 20:31:35 miod Exp $
.\" $NetBSD: pcppi.4,v 1.5 2001/10/02 20:37:00 augustss Exp $
.\"
.\" Copyright (c) 1999
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 1, 2002
.Dt PCPPI 4
.Os
.Sh NAME
.Nm pcppi
.Nd PC (ISA) control and timer port driver
.Sh SYNOPSIS
.Cd "pcppi*   at isa?"
.Cd "spkr0    at pcppi?"
.Cd "midi*    at pcppi?"
.Sh DESCRIPTION
The
.Nm
driver handles resource allocation and device attachment for the
ports related to the ISA speaker in the traditional PC/AT
.Dq design .
These are the
.Dq system control port
(which was implemented by the 8255
.Dq PPI
in the XT, hence the name of this driver)
at IO address 0x61 and the first 8253 timer at 0x40-0x43.
.Pp
The
.Nm
driver provides its child devices with the ability to output simple
tones through the PC speaker.
The
.Xr speaker 4
and
.Xr midi 4
devices use this to synthesize sounds.
It also provides helper functions to the
.Xr pckbd 4
driver as a substitute for a
.Dq keyboard beep ,
because the PC keyboard hardware doesn't provide this.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr midi 4 ,
.Xr pckbd 4 ,
.Xr speaker 4
