NCommander/openbsd-src-with-branches/share/man/man4/pvclock.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2018 Reyk Floeter <reyk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt PVCLOCK 4
.Os
.Sh NAME
.Nm pvclock
.Nd paravirtual clock driver
.Sh SYNOPSIS
.Cd "pvclock* at pvbus?
.Sh DESCRIPTION
The
.Nm
driver supports the paravirtual clock that is available in KVM and
other hypervisors.
.Nm
uses a shared page between the host and the hypervisor to synchronize
the TSC clock in an efficient way.
.Sh SEE ALSO
.Xr pvbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Reyk Floeter Aq Mt reyk@openbsd.org .
