NCommander/openbsd-src-with-branches/share/man/man4/qcspmi.4
.\"	$OpenBSD: qcspmi.4,v 1.2 2021/05/30 12:26:04 jmc Exp $
.\"
.\" Copyright (c) 2022 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 30 2021 $
.Dt QCSPMI 4
.Os
.Sh NAME
.Nm qcspmi
.Nd Qualcomm SPMI controller
.Sh SYNOPSIS
.Cd "qcspmi* at fdt?"
.Cd "qcpmic* at qcspmi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SPMI controller found on various
Qualcomm Snapdragon SoCs.
.Sh SEE ALSO
.Xr qcpmic 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
