NCommander/openbsd-src-with-branches/share/man/man4/qla.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2014 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 7 2014 $
.Dt QLA 4
.Os
.Sh NAME
.Nm qla
.Nd QLogic Fibre Channel Controllers
.Sh SYNOPSIS
.Cd "qla* at pci?     " Pq PCI
.Cd "qla* at sbus?    " Pq SBus
.Sh DESCRIPTION
The
.Nm
driver provides support for QLogic Fibre Channel host bus adapters using
the following family of chipsets:
.Pp
.Bl -dash -offset indent -compact
.It
ISP2100,
ISP2200,
ISP2300
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr sbus 4 ,
.Xr scsi 4
.Sh AUTHORS
The
.Nm
driver was written by
.An Jonathan Matthew Aq Mt jmatthew@openbsd.org .
