NCommander/openbsd-src-with-branches/share/man/man4/random.4
.\"	$OpenBSD: random.4,v 1.29 2011/01/11 15:26:05 deraadt Exp $
.\"
.\" Copyright (c) 1996, 1997 Michael Shalayeff
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 11 2011 $
.Dt RANDOM 4
.Os
.Sh NAME
.Nm random ,
.Nm arandom
.Nd random data source devices
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <dev/rndvar.h>
.Sh DESCRIPTION
The various
.Nm
devices produce high quality random output data.
Entropy data is collected from system activity (such as disk, network,
and clock device interrupts), and then used to key the
ChaCha stream cipher to generate the output.
All the random devices are expected to provide high quality
pseudo-random output data.
.Pp
The
.Xr arc4random 3
function in userland libraries should be used instead, as it works
without the need to access these devices every time.
.Sh FILES
.Bl -tag -width /dev/arandom -compact
.It Pa /dev/random
.It Pa /dev/arandom
.El
.Sh SEE ALSO
.Xr arc4random 3 ,
.Xr md5 3 ,
.Xr random 3 ,
.Xr amdpm 4 ,
.Xr glxsb 4 ,
.Xr pchb 4 ,
.Xr arc4random 9 ,
.Xr md5 9
.Sh HISTORY
A
.Nm
device first appeared in the Linux operating system.
This is a cloned interface.
.Pp
ARC4 routines added by David Mazieres.
Changed to use the ChaCha cipher in
.Ox 5.5 .
.Sh BUGS
No randomness testing suite provided.
