NCommander/openbsd-src-with-branches/share/man/man4/ricohrtc.4
.\"	$OpenBSD: ricohrtc.4,v 1.3 2012/07/12 20:12:03 jasper Exp $
.\"
.\" Copyright (c) 2006 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 12 2012 $
.Dt RICOHRTC 4
.Os
.Sh NAME
.Nm ricohrtc
.Nd Ricoh RS5C372 Real Time Clock
.Sh SYNOPSIS
.Cd "ricohrtc* at iic? addr 0x32"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Ricoh RS5C372 Real Time Clock chip.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Dale Rahn Aq Mt drahn@openbsd.org .
