NCommander/openbsd-src-with-branches/share/man/man4/rkdrm.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt RKDRM 4
.Os
.Sh NAME
.Nm rkdrm
.Nd Rockchip DRM subsystem
.Sh SYNOPSIS
.Cd "rkdrm* at fdt?"
.Cd "drm* at rkdrm?"
.Cd "wsdisplay* at rkdrm?"
.Sh DESCRIPTION
The
.Nm
driver provides kernel mode setting (KMS) functionality for the
graphics hardware integrated on Rockchip SoCs.
.Sh SEE ALSO
.Xr drm 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared D. McNeill
for
.Nx
and ported to
.Ox
by
.An Patrick Wildt Aq Mt patrick@blueri.se .
