NCommander/openbsd-src-with-branches/share/man/man4/rkdwusb.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2018 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt RKDWUSB 4
.Os
.Sh NAME
.Nm rkdwusb
.Nd Rockchip USB 3.0 glue logic
.Sh SYNOPSIS
.Cd "rkdwusb* at fdt?"
.Cd "xhci* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the interface logic for the Synopsys DesignWare USB
3.0 controller on Rockchip SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr xhci 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
