NCommander/openbsd-src-with-branches/share/man/man4/scmi.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2023 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt SCMI 4
.Os
.Sh NAME
.Nm scmi
.Nd System Control and Management Interface
.Sh SYNOPSIS
.Cd "smci* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver handles clocks that are managed through the the ARM System
Control and Management Interface specification.
.Sh SEE ALSO
.Rs
.%T System Control and Management Interface (SCMI) specification
.%N ARM DEN 0056C
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
