NCommander/openbsd-src-with-branches/share/man/man4/sili.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2007 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd March 22, 2007
.Dt SILI 4
.Os
.Sh NAME
.Nm sili
.Nd Silicon Image 3124/3132/3531 SATA controller
.Sh SYNOPSIS
.Cd "sili* at pci?"
.Cd "scsibus* at sili?"
.Sh DESCRIPTION
The
.Nm
driver provides support for SATA controllers using the Silicon Image
3124/3132/3531 SATALink chipsets.
.Pp
Although
.Nm
controllers are actual ATA controllers, the driver emulates SCSI via a
translation layer.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org .
