NCommander/openbsd-src-with-branches/share/man/man4/simpleamp.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2020 Patrick Wildt <patrick@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt SIMPLEAMP 4
.Os
.Sh NAME
.Nm simpleamp
.Nd simple audio amplifier
.Sh SYNOPSIS
.Cd "simpleamp* at fdt?"
.Sh DESCRIPTION
.Nm
is a generic driver for audio amplifier.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr simpleaudio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.8 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
