NCommander/openbsd-src-with-branches/share/man/man4/ssdfb.4
.\" $OpenBSD$
.\"
.\" Copyright (c) 2019 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt SSDFB 4
.Os
.Sh NAME
.Nm ssdfb
.Nd SSD1306 / SSD1309 OLED display modules
.Sh SYNOPSIS
.Cd "ssdfb* at iic?"
.Cd "ssdfb* at spi?"
.Cd "wsdisplay* at ssdfb?"
.Sh DESCRIPTION
The
.Nm
driver supports OLED display modules based on the Solomon Systech SSD1306 or
SSD1309 chips.
The support for partial updates in both the chip and the driver improves the
display's responsiveness.
Due to the small resolution of about 128x64 the display makes most sense as a
text-based terminal.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
