NCommander/openbsd-src-with-branches/share/man/man4/ubcmtp.4
.\" $OpenBSD: ubcmtp.4,v 1.1 2014/01/22 14:31:40 jcs Exp $
.\"
.\" Copyright (c) 2014, joshua stein <jcs@openbsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the copyright holder may not be used to endorse or
.\"    promote products derived from this software without specific
.\"    prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 22 2014 $
.Dt UBCMTP 4
.Os
.Sh NAME
.Nm ubcmtp
.Nd Broadcom trackpad mouse
.Sh SYNOPSIS
.Cd "ubcmtp*  at uhidev?"
.Cd "wsmouse* at ubcmtp? mux 0"
.Sh DESCRIPTION
The
.Nm
driver provides support for Broadcom multi-touch trackpads found on
newer Apple MacBook, MacBook Pro, and MacBook Air laptops.
.Sh SEE ALSO
.Xr uhidev 4 ,
.Xr usb 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
driver
first appeared in
.Ox 5.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An joshua stein Aq Mt jcs@openbsd.org .
