NCommander/openbsd-src-with-branches/share/man/man4/udl.4
.\" $OpenBSD: udl.4,v 1.9 2009/06/06 16:58:27 yuo Exp $
.\"
.\" Copyright (c) 2009 Marcus Glocker <mglocker@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 6 2009 $
.Dt UDL 4
.Os
.Sh NAME
.Nm udl
.Nd DisplayLink DL-120 / DL-160 USB display devices
.Sh SYNOPSIS
.Cd "udl* at uhub?"
.Cd "wsdisplay* at udl?"
.Sh DESCRIPTION
The
.Nm
driver supports USB display devices based on the DisplayLink DL-120 / DL-160
graphic chip.
.Sh HARDWARE
The following devices should work:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Century Corp. Japan Plus One LCD-8000U
.It Century Corp. Japan Plus One LCD-4300U
.It DisplayLink USB to DVI
.It ForwardVideo EasyCAP008 USB to DVI
.It HP USB 2.0 Docking Station (FQ834)
.It König CMP-USBVGA10
.It Lenovo 45K5296 USB to DVI
.It Rextron VCUD60 USB to DVI
.It Sunweit USB to DVI
.It Unitek Y-2240 USB to DVI
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr usb 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
