NCommander/openbsd-src-with-branches/share/man/man4/umcs.4
.\" $OpenBSD$
.\"
.\" Copyright (c) 2014 Martin Pieuchot
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt UMCS 4
.Os
.Sh NAME
.Nm umcs
.Nd MosChip Semiconductor based USB multiport serial adapter
.Sh SYNOPSIS
.Cd "umcs* at uhub?"
.Cd "ucom* at umcs?"
.Sh DESCRIPTION
The
.Nm
driver supports various MosChip Semiconductor based serial adapters.
.Pp
The following devices should work with the
.Nm
driver:
.Bd -literal -offset indent
LogiLink AU0033
ST Lab U-360
ST Lab U-400
.Ed
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.7 .
