NCommander/openbsd-src-with-branches/share/man/man4/umstc.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2020 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt UMSTC 4
.Os
.Sh NAME
.Nm umstc
.Nd Microsoft Surface Type Cover driver
.Sh SYNOPSIS
.Cd "umstc* at uhidev?"
.Sh DESCRIPTION
The
.Nm
driver responds to some special keys on the Microsoft Type Cover
keyboard, such as volume and screen brightness keys.
.Sh SEE ALSO
.Xr uhidev 4 ,
.Xr usb 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An joshua stein Aq Mt jcs@jcs.org .
