NCommander/openbsd-src-with-branches/share/man/man4/umt.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2016-2018 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt UMT 4
.Os
.Sh NAME
.Nm umt
.Nd USB HID multitouch touchpad devices
.Sh SYNOPSIS
.Cd "umt* at uhidev?"
.Cd "wsmouse* at umt? mux 0"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB HID touchpads conforming to the
Windows Precision Touchpad standard.
Access to these devices is through the
.Xr wscons 4
driver.
.Sh SEE ALSO
.Xr uhidev 4 ,
.Xr ums 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An joshua stein Aq Mt jcs@openbsd.org .
