NCommander/openbsd-src-with-branches/share/man/man4/uoakrh.4
.\"	$OpenBSD: uoakrh.4,v 1.5 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2012 Yojiro UO <yuo@nui.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt UOAKRH 4
.Os
.Sh NAME
.Nm uoakrh
.Nd Toradex OAK USB temperature and relative humidity sensor
.Sh SYNOPSIS
.Cd "uoakrh* at uhidev?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Toradex OAK RH.
The sensor possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface.
The relative humidity data unit is "%RH" and the temperature data
unit is "degC".
The device has a unique serial number,
indicated in the description part of the sensor value.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhidev 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Rs
.%T Toradex Web Page
.%U http://developer.toradex.com/hardware-resources/usb-sensors-and-peripherals
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Yojiro UO Aq Mt yuo@nui.org .
