NCommander/openbsd-src-with-branches/share/man/man4/upd.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2014 Andre de Oliveira <andre@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 8 2014 $
.Dt UPD 4
.Os
.Sh NAME
.Nm upd
.Nd USB Power Devices battery voltage and load sensor
.Sh SYNOPSIS
.Cd "upd* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver exposes data from USB Power Devices (such as an UPS),
as hardware sensors via
.Xr sysctl 3 .
The following devices are supported by the
.Nm
driver:
.Bl -bullet -offset indent
.It
American Power Conversion Smart-UPS 750
.It
American Power Conversion Back-UPS CS 350
.El
.Pp
The following sensors are provided by the
.Nm
driver, which can be monitored using
.Xr sensorsd 8 :
.Bl -bullet -offset indent
.It
RelativeStateOfCharge
.It
AbsoluteStateOfCharge
.It
RemainingCapacity
.It
FullChargeCapacity
.It
Charging
.It
Discharging
.It
BatteryPresent
.It
ShutdownImminent
.It
ACPresent
.It
AtRateTimeToFull
.El
.Sh EXAMPLES
In this example, the upd0 device is a regular UPS.
We use an entry on
.Xr sensorsd 8
to take an action when the battery level is below a 70%:
.Bd -literal
hw.sensors.upd0.percent0:low=70:command=/etc/sensorsd/lowbattwarn %l
.Ed
.Pp
The contents of lowbattwarn could be:
.Bd -literal -offset indent
#!/bin/ksh

if [ $# -lt 1 ]; then
        return;
fi

if [ $1 -lt 70 ]; then
        logger "ups battery warning-level, halting"
        /sbin/halt -p
fi
.Ed
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhub 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Andre de Oliveira Aq Mt andre@openbsd.org ,
partially sponsored by Esdenera Networks GmbH.
.Sh CAVEATS
When the battery is not present, even with Battery Presence indicator set to
Off the remaining battery sensors will still be present, besides their values
cannot be trusted.
.Pp
Users of apcupsd port will notice either
.Xr ugen 4 ,
is missing, it is necessary to disable the
.Nm
driver
in order to use apcupsd.
