NCommander/openbsd-src-with-branches/share/man/man4/utrh.4
.\"	$OpenBSD:$
.\"
.\" Copyright (c) 2009 Yojiro UO <yuo@nui.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 17 2009 $
.Dt UTRH 4
.Os
.Sh NAME
.Nm utrh
.Nd USBRH temperature and humidity sensor
.Sh SYNOPSIS
.Cd "utrh* at uhidev?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Strawberry linux's USBRH device.
The sensor possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface.
The humidity data unit is "%RH" and the temperature data unit
is "degC".
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhidev 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Yojiro UO Aq yuo@nui.org .
