NCommander/openbsd-src-with-branches/share/man/man4/uvideo.4
.\" $OpenBSD: uvideo.4,v 1.5 2008/06/08 21:59:57 robert Exp $
.\"
.\" Copyright (c) 2008 Ian Darwin.  All rights reserved.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 8 2008 $
.Dt UVIDEO 4
.Os
.Sh NAME
.Nm uvideo
.Nd USB video devices
.Sh SYNOPSIS
.Cd "uvideo*     at uhub?"
.Cd "video*      at uvideo?"
.Sh DESCRIPTION
The
.Nm
driver supports a range of USB Video Class (UVC) devices including webcams,
camcorders and other cameras.
UVC is a generic specification and many USB video devices follow it.
The following models are known to work:
.Pp
.Bl -tag -width "LogitechXXX" -offset indent -compact
.It Logitech
QuickCam Fusion
.It Logitech
QuickCam Pro 5000
.It Logitech
QuickCam Pro 9000
.El
.Pp
If the
.Nm
device attaches successfully, it will attach the
.\".Xr video 4
video
driver to provide higher-level access.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr usb 4
.\" .Xr video 4
.Sh HISTORY
The
.Nm
driver
first appeared in
.Ox 4.4 .
