NCommander/openbsd-src-with-branches/share/man/man4/viapm.4
.\"	$OpenBSD: viapm.4,v 1.3 2006/09/07 10:42:25 jmc Exp $
.\"
.\" Copyright (c) 2006 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 1, 2006
.Dt VIAPM 4
.Os
.Sh NAME
.Nm viapm
.Nd VIA SMBus controller
.Sh SYNOPSIS
.Cd "viapm* at pci?"
.Cd "iic* at viapm?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the bus control and power management
component of the VIA VT8233, VT8235, VT8237, VT8251 and CX700 South Bridges.
Only the SMBus host interface is supported and can be used with the
.Xr iic 4
framework.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
.Sh BUGS
The driver doesn't support commands with a data buffer size of more
than 2 bytes.
