NCommander/openbsd-src-with-branches/share/man/man4/vio.4
.\"     $OpenBSD: $
.\"
.\" Copyright (c) 2012 Stefan Fritsch <sf@sfritsch.de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt VIO 4
.Os
.Sh NAME
.Nm vio
.Nd virtual network device
.Sh SYNOPSIS
.Cd "vio* at virtio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the virtio network interface provided by some
hypervisors like kvm or virtualbox.
.Pp
.Sh SEE ALSO
.Xr virtio 4 ,
.Xr intro 4 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
The
.Nm
driver was ported to OpenBSD and improved by
.An Stefan Fritsch Aq sf@sfritsch.de .
It is based on the NetBSD
.Nm vioif
driver by
.An Minoura Makoto .
.Sh BUGS
.Nm
currently does not support jumbo frames.
