NCommander/openbsd-src-with-branches/share/man/man4/wbenv.4
.\"	$OpenBSD: wbenv.4,v 1.3 2006/09/07 10:42:25 jmc Exp $
.\"
.\" Copyright (c) 2006 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt WBENV 4
.Os
.Sh NAME
.Nm wbenv
.Nd Winbond W83L784R/W83L785R/W83L785TS-L temperature, voltage, and fan sensor
.Sh SYNOPSIS
.Cd "wbenv* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Winbond
W83L784R, W83L785R and W83L785TS-L hardware monitors to be used with
the
.Xr sysctl 8
interface.
.Pp
The W83L874R and W83L785R possess several voltage, temperature and fan
speed sensors.
The W83L785TS-L only has a single temperature sensor.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
