NCommander/openbsd-src-with-branches/share/man/man4/wskbd.4
.\" $OpenBSD: wskbd.4,v 1.3 2001/03/27 22:44:55 aaron Exp $
.\" $NetBSD: wskbd.4,v 1.5 2000/03/20 11:51:59 pk Exp $
.\"
.Dd March 20, 1999
.Dt WSKBD 4
.Os
.Sh NAME
.Nm wskbd
.Nd generic keyboard support in wscons
.Sh SYNOPSIS
.Cd "wskbd* at pckbd? console ? mux 1"
.Cd "wskbd* at ukbd? console ? mux 1"
.Cd "wskbd0 at akbd? console ? mux 1"
.Sh DESCRIPTION
The
.Nm
driver handles common tasks for keyboards within the
.Xr wscons 4
framework.
It is attached to the hardware specific keyboard drivers and
provides their connection to
.Dq wsdisplay
devices and a character device interface.
.Pp
The common keyboard support consists of:
.Bl -bullet
.It
Mapping from keycodes (defined by the specific keyboard driver) to
keysyms (hardware independent, defined in
.Pa /usr/include/dev/wscons/wsksymdef.h ) .
.It
Handling of
.Dq compose
sequences.
Characters commonly not present as separate key on keyboards
can be generated after either a special
.Dq compose
key is pressed or a
.Dq dead accent
character is used.
.It
Certain translations, like turning an
.Dq ALT
modifier into an
.Dq ESC
prefix.
.It
Automatic key repetition
.Pf ( Dq typematic ) .
.It
Parameter handling for
.Dq keyboard bells .
.It
Generation of
.Dq keyboard events
for use by X servers.
.El
.Pp
The
.Nm
driver provides a number of ioctl functions to control key maps
and other parameters.
These functions are accessible though the associated
.Dq wsdisplay
device as well.
A complete list is in
.Pa /usr/include/dev/wscons/wsconsio.h .
The
.Xr wsconsctl 8
utility allows to access key maps and other variables.
.Pp
The
.Em console
locator in the configuration line refers to the device's use as input
part of the operating system console.
A device specification containing a positive value here will only match
if the device is in use as system console.
(The console device selection in early system startup is not influenced.)
This way, the console device can be connected to a known
.Xr wskbd 4
device instance.
.Sh FILES
.Bl -tag -width /usr/include/dev/wscons/wsksymdef.h -compact
.It Pa /dev/wskbd*
.It Pa /usr/include/dev/wscons/wsksymdef.h
.It Pa /usr/include/dev/wscons/wsconsio.h
.El
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsmux 4 ,
.Xr pckbd 4 ,
.Xr ukbd 4 ,
.Xr wsconsctl 8
