NCommander/openbsd-src-with-branches/share/man/man4/xhci.4
.\" $OpenBSD$
.\"
.\" Copyright (c) 2014 Martin Pieuchot
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt XHCI 4
.Os
.Sh NAME
.Nm xhci
.Nd USB eXtensible Host Controller Interface
.Sh SYNOPSIS
.Cd "xhci* at pci?"
.Cd "usb*  at xhci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the USB eXtensible Host Controller Interface,
which provides an interface to
.Xr usb 4
devices.
.Pp
xHCI controllers support all USB 3.0, 2.0 and 1.x device speeds.
.Sh SEE ALSO
.Xr pci 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 5.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Martin Pieuchot Aq Mt mpi@openbsd.org .
