NCommander/openbsd-src-with-branches/usr.bin/midiplay/midiplay.1
.\" $OpenBSD: midiplay.1,v 1.14 2009/08/16 09:41:08 sobrado Exp $
.\" $NetBSD: midiplay.1,v 1.3 1998/08/13 18:26:36 augustss Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: August 16 2009 $
.Dt MIDIPLAY 1
.Os
.Sh NAME
.Nm midiplay
.Nd play MIDI files
.Sh SYNOPSIS
.Nm midiplay
.Op Fl gmqvx
.Op Fl f Ar device
.Op Fl t Ar tempo
.Op Ar
.Sh DESCRIPTION
The
.Nm
command plays MIDI files.
If no file name is given it will play from standard input;
otherwise it will play the named files.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f Ar device
Specifies the name of the
.Xr sndio 7
MIDI device.
.It Fl g
Send a
.Dq General MIDI On
system exclusive message to the device.
.It Fl m
Show MIDI file meta events (copyright, lyrics, etc.).
.It Fl q
Do not play the MIDI file, just parse it.
.It Fl t Ar tempo
Specifies the tempo.
Default is 100.
.It Fl v
Be verbose.
If the flag is repeated, the verbosity increases.
.It Fl x
Play a small sample sound.
.El
.Sh SEE ALSO
.Xr midicat 1 ,
.Xr midi 4 ,
.Xr sndio 7
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.4 .
