NCommander/openbsd-src-with-branches/share/man/man4/man4.mvme68k/ssh.4
.\"	$OpenBSD: siop.4,v 1.5 2001/07/03 06:28:10 mickey Exp $
.\"	$NetBSD: siop.4,v 1.3 2000/10/23 16:38:10 bouyer Exp $
.\"
.\" Copyright (c) 2000 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,     
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 15, 2000
.Dt SSH 4 mvme68k
.Os
.Sh NAME
.Nm ssh
.Nd NCR 53c7xx SCSI driver
.Sh SYNOPSIS
.Cd "ssh0 at mc0 offset 0x47000 ipl 2"
.Cd "ssh0 at pcctwo0 offset 0x47000 ipl 2"
.Cd "scsibus* at ssh?"
.Sh DESCRIPTION
The
.Nm
driver provides support for NCR 53c7xx and related
.Tn SCSI
controller chips.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr mc 4 ,
.Xr pcctwo 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr uk 4
.Pp
.Pa http://www.lsilogic.com/
