NCommander/openbsd-src-with-branches/usr.bin/locate/locate/locate.updatedb.8
.\"	$OpenBSD: locate.updatedb.8,v 1.21 2021/08/07 11:23:07 schwarze Exp $
.\"
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mike Pritchard.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: August 7 2021 $
.Dt LOCATE.UPDATEDB 8
.Os
.Sh NAME
.Nm locate.updatedb
.Nd update locate database
.Sh SYNOPSIS
.Nm locate.updatedb
.Op Fl \-fcodes Ns = Ns Ar dbfile
.Op Fl \-filesystems Ns = Ns Eo \(aq Ar type ... Ec \(aq
.Op Fl \-prunepaths Ns = Ns Eo \(aq Ar dir ... Ec \(aq
.Op Fl \-searchpaths Ns = Ns Eo \(aq Ar dir ... Ec \(aq
.Op Fl \-tmpdir Ns = Ns Ar dir
.Sh DESCRIPTION
.Nm
updates the database used by
.Xr locate 1 .
It is typically run once a week by the
.Xr weekly 8
script.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl \-fcodes
Output to an alternate database file instead of the default
.Pa /var/db/locate.database .
If
.Ql \-
is specified in place of the file name,
send the database to the standard output.
.It Fl \-filesystems
A list of filesystem types to be traversed by
.Xr find 1 .
The default is
.Eo \(aq ffs ufs Ec \(aq .
.It Fl \-prunepaths
Set the list of parent directories that should not go in the database.
The default is
.Eo \(aq Pa /tmp /var/tmp Ec \(aq .
.It Fl \-searchpaths
Set the list of directories to be put in the database.
The default is
.Eo \(aq Pa / Ec \(aq .
.It Fl \-tmpdir
Set the directory temporary files are stored in.
The default is
.Pa /tmp .
.El
.Pp
The default settings are modified by the optional configuration file
.Pa /etc/locate.rc .
It is a
.Xr sh 1
script that can be used to set variables.
The names of the variables match the names of the command line
options, but in all caps.
.Sh FILES
.Bl -tag -width /var/db/locate.database -compact
.It Pa /etc/locate.rc
configuration file
.It Pa /var/db/locate.database
default database
.El
.Sh SEE ALSO
.Xr find 1 ,
.Xr locate 1 ,
.Xr locate.mklocatedb 8 ,
.Xr weekly 8
.Rs
.%A Woods, James A.
.%D 1983
.%T "Finding Files Fast"
.%J ";login"
.%V 8:1
.%P pp. 8-10
.Re
