NCommander/openbsd-src-with-branches/usr.sbin/afs/src/arlad/SuidCells.5
.\" Copyright (c) 2000 - 2003 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $arla: SuidCells.5,v 1.9 2003/06/06 12:53:53 hin Exp $
.\"     $OpenBSD: SuidCells.5,v 1.1 2000/04/27 23:02:14 hin Exp $
.\"
.Dd April 19, 2000
.Dt SuidCells 5
.Os "The Arla Project"
.Sh NAME
.Nm SuidCells
.Nd lists AFS cells for which
.Nm arlad
will honor the setuid bit
.Sh DESCRIPTION
The setuid bit on binaries executed from AFS are ignored
for the cells that are not listed in
.Nm Ns .
.Pp
The
.Nm
file contain a list of cells separated by newlines. The cells
need to exist in CellServDB or in DNS (with AFSDB resource records).
.Sh SEE ALSO
.Xr AliasDB 5 ,
.Xr DynRootDB 5 ,
.Xr CellServDB 5 ,
.Xr ThisCell 5 ,
.Xr arla.conf 5 ,
.Xr arlad 8
