NCommander/openbsd-src-with-branches/share/man/man9/hz.9
.\"	$OpenBSD$
.\"
.\" Copyright (c) 1999 Marc Espie
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Marc Espie
.\"      for the OpenBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 31, 1999
.Dt HZ 9
.Os
.Sh NAME
.Nm hz ,
.Nm tick ,
.Nm tickadj ,
.Nm stathz ,
.Nm profhz 
.Nd system time model.
.Sh SYNOPSIS
.Va extern int hz;
.br
.Va extern int tick;
.br
.Va extern int tickadj;
.br
.Va extern int stathz;
.br
.Va extern int stathz;
.Sh DESCRIPTION
The system is driven by
.Xr hardclock 9
interrupts, which occur at
.Va hz
frequency, and are used to keep track of real time.
.Pp
On systems where another independent clock is available, it is set at
.Va stathz
frequency, and used to gather timing statistics.  Otherwise, 
.Va stathz 
is set to
.Va hz .
.Pp
If profiling is enabled, the second clock may be run at a higher rate
.Va profhz ,
which must be a multiple of
.Va stathz .
.Pp
Normally, 
.Xr hardclock 9
increments
.Va time
by 
.Va tick
each time it is called.
If the system clock has drifted, 
.Xr adjtime 2 
may be used to skew this increment, but by no more
than ten times
.Va tickadj .
.Pp
Those systems variables are available as a struct clockinfo from
.Xr sysctl 3 .
.Sh SEE ALSO
.Xr adjtime 2 ,
.Xr clock_getres 2 ,
.Xr sysctl 3 ,
.Xr hardclock 9 ,
.Xr microtime 9
