NCommander/openbsd-src-with-branches/share/man/man9/pfind.9
.\"	$OpenBSD: pfind.9,v 1.4 2001/06/27 08:44:03 aaron Exp $
.\"
.\" Copyright (c) 1999 Marc Espie
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 1, 1999
.Dt PFIND 9
.Os
.Sh NAME
.Nm pfind ,
.Nm pgfind
.Nd find process / process group by number
.Sh SYNOPSIS
.Fd #include <sys/cdefs.h>
.Fd #include <sys/proc.h>
.Ft "struct proc *"
.Fn pfind "pid_t pid"
.Ft "struct pgrp *"
.Fn pgfind "pid_t pgid"
.Sh DESCRIPTION
The
.Fn pfind
and
.Fn pgfind
functions retrieve process and progress group structures from process and
process group IDs.
.Pp
Both functions return
.Dv NULL
if the requested ID can't be found.
.Sh CODE REFERENCES
Those functions are implemented in the file
.Pa sys/kern/kern_proc.c .
