NCommander/openbsd-src-with-branches/share/man/man9/random.9
.\"	$OpenBSD: random.9,v 1.5 1999/05/23 14:11:40 aaron Exp $
.\"
.\" Copyright (c) 1996	Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Michael Shalayeff
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 26, 1996
.Dt RND 9
.Os
.Sh NAME
.Nm random
.Nd device kernel interface
.Sh SYNOPSIS
.Fd #include <dev/rndvar.h>
.Ft void 
.Fn add_mouse_randomness "u_int32_t"
.Ft void
.Fn add_tty_randomness "int"
.Ft void 
.Fn add_net_randomness "int isr"
.Ft void 
.Fn add_blkdev_randomness "u_int32_t"
.Ft void
.Fn get_random_bytes "void *buf" "size_t nbytes"
.Ft u_int32_t 
.Fn arc4random "void"
.br
.Sh DESCRIPTION
add_{mouse,tty,net,blkdev}_randomness routines used to supply data
for the random data source device for future processing.
.Pp
.Nm get_random_bytes
may be used to retrieve strong random data, just
as it would by
.Xr srandom 4
device.
.br
.Nm arc4random
will give random 32 bit numbers hashed with the aRC4 algorithm,
which appears to be faster.
.Sh SEE ALSO
.Xr arc4random 3 ,
.Xr random 4
