NCommander/openbsd-src-with-branches/sbin/kbd/kbd.8
.\"	$OpenBSD: kbd.8,v 1.11 2007/05/31 19:19:45 jmc Exp $
.\"
.\" Copyright (c) 1996 Juergen Hannken-Illjes
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Juergen Hannken-Illjes.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt KBD 8
.Os
.Sh NAME
.Nm kbd
.Nd set national keyboard translation
.Sh SYNOPSIS
.Nm kbd
.Fl l
.Nm kbd
.Op Fl q
.Ar name
.Sh DESCRIPTION
.Nm
is used to change the keyboard encoding.
The encoding is set to national keyboard layout
.Ar name ,
and a short message is printed to stdout.
.Pp
The execution of
.Nm
normally occurs in the system multi-user initialization file
.Pa /etc/rc
using the encoding defined in
.Pa /etc/kbdtype .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl l
List all available keyboard encodings.
.It Fl q
Quiet mode.
No message is printed unless an error occurs.
.El
.Sh FILES
.Bl -tag -width "/etc/kbdtypeXXX"
.It /etc/kbdtype
Default national encoding.
.El
